{
  "common": {
    "about": "About",
    "abouthelloim": "Hello, i'm",
    "aboutp1": "👨‍💻 With many years' experience in web development, I specialize in Back-End, business applications and custom software development.",
    "aboutp2": "✅ Whether you need to develop a complex web application, set up an efficient management system or improve the performance of your existing site, I'm here to support you every step of the way, from design to delivery, deployment and maintenance.",
    "aboutp3": "💬 Contact me now to discuss your project and let's start working together to achieve your goals!",
    "about_rich": "Hello,\n\n👨‍💻 With several years of experience in web development, I have worked with large corporations and startups in various sectors such as retail, innovation, and cybersecurity. I specialize in back-end, management applications, and custom software development.\n\n✅ Whether you need to develop a complex web application, set up a high-performance management system, or improve your existing site's performance, I am here to support you at every stage of the process, from design to delivery, including deployment and maintenance.\n💻 Web development: I develop new features, maintain and evolve existing systems, and fix bugs. With my expertise in ASP.NET, PHP, and the Symfony, CakePHP, and Zend frameworks, I offer tailor-made solutions adapted to your needs.\n🔌 API integration: I can integrate third-party applications to enrich your web solutions or create your own API to interconnect your applications, thus improving the efficiency and productivity of your systems.\n🔧 Refactoring: I restructure and optimize existing code to facilitate maintenance and evolution, while improving readability and application performance.\n🎨 UI redesign: I design modern, responsive user interfaces, providing an optimal user experience on all screen sizes.\n🌐 Web server management: I set up and configure high-performance, secure web server infrastructures, or help you change your domain name.\n💬 Contact me now to discuss your project and let's work together to achieve your goals!",
    "contact": "Contact",
    "contactme": "Contact me",
    "getresume": "Resume",
    "getresumefile": "EN_CV_KamalAITYOUS.pdf",
    "home": "Home",
    "language": "Language",
    "main1": "Make Your Web Application",
    "main2": "Come True",
    "projects": "Projects",
    "seeMore": "See more",
    "selectLanguage": "Select a language",
    "skills": "Skills",
    "skills_search_placeholder": "Search a technology or skill...",
    "skills_search_aria": "Search a skill",
    "skills_mastered_tooltip": "Mastered",
    "more_skills_aria": "Show {{count}} more skills: {{skills}}",
    "sub1": "Looking for a versatile freelance developer to help you\n            your web projects?",
    "sub2": "You've come to the right place!",
    "technologies": "Technologies:",
    "softSkills": "Soft Skills:",
    "projectContext": "Project Context",
    "myRole": "My Role",
    "keyActions": "Key Actions & Impact",
    "keyChallenges": "Key Challenges",
    "solutionsImplemented": "Solutions Implemented",
    "externalLinks": "External Links",
    "skills_category_Backend": "Backend",
    "skills_category_Frontend": "Frontend",
    "skills_category_Fullstack": "Fullstack",
    "skills_category_DevOps": "DevOps",
    "skills_category_Data": "Data",
    "skills_category_Other": "Other",
    "skills_category_SoftSkills": "Soft Skills",
    "skills_other_agile": "Agile Methodology",
    "skills_other_webdesign": "Web Design",
    "read_more": "Read more",
    "skills_other_webdesign": "Web Design",
    "skills_desc.Teamwork": "Ability to work effectively within a team.",
    "skills_desc.Team Collaboration": "Ability to work effectively within a team.",
    "skills_desc.Problem Solving": "Ability to analyze and resolve complex issues.",
    "skills_desc.Technical Documentation": "Writing and maintaining technical documentation.",
    "skills_desc.User Experience Design": "Designing user-friendly and accessible interfaces.",
    "skills_desc.Data Visualization": "Presenting data in a clear and impactful way.",
    "skills_desc.UI/UX Design": "Designing modern, responsive user interfaces.",
    "skills_desc.Version Control": "Managing code changes and collaboration.",
    "skills_desc.Leadership Technique": "Leading teams and projects with technical expertise.",
    "skills_desc.Architecture Système": "Designing robust and scalable system architectures.",
    "skills_desc.Optimisation des Performances": "Improving application speed and efficiency.",
    "skills_desc.Fullstack Development": "Experience with both front-end and back-end development.",
    "skills_desc.API Design": "Designing robust and scalable APIs.",
    "skills_desc.Community Management": "Managing and engaging with user communities.",
    "skills_desc.Process Automation": "Automating repetitive tasks and processes.",
    "skills_desc.Data Processing": "Handling and transforming data efficiently.",
    "skills_desc.Reliability": "Ensuring systems are dependable and robust.",
    "skills_desc.Autonomous Work": "Ability to work independently.",
    "skills_desc.Proactivity": "Taking initiative and acting in advance.",
    "skills_desc.Responsiveness": "Reacting quickly and positively.",
    "skills_desc.Initiative": "Ability to assess and initiate things independently.",
    "skills_desc.Communication": "Effectively conveying information and ideas.",
    "skills_desc.Force de proposition": "Ability to propose ideas and solutions.",
    "skills_desc.Travail en autonomie": "Ability to work independently.",
    "skills_desc.Réactivité": "Ability to react quickly and efficiently.",
    "skills_desc.Automatisation des processus": "Implementing solutions to automate repetitive tasks.",
    "skills_desc.Traitement de données": "Efficient data management and transformation.",
    "skills_desc.Fiabilité": "Ensuring system robustness and stability.",
    "skills_category_All": "All",
    "project_nav_next": "Next Project",
    "project_nav_prev": "Previous Project",
    "project_tasks_title": "Tasks Completed"
  },
  "portfolio": {
    "description": "Bienvenue sur mon portfolio ! Vous trouverez ici une vitrine de mes compétences et de mon expérience.",
    "noProjects": "Aucun projet à afficher pour le moment.",
    "title": "Mon Portfolio"
  },
  "projects": {
    "apigem": {
      "description": "Led the complete redesign of Apigem's web application, focusing on modern UI/UX principles and responsive design to enhance user experience and accessibility",
      "img": "/images/project-images/apigem/logo.png",
      "mainTechnologies": [
        "PHP",
        "Bootstrap",
        "jQuery",
        "MySQL",
        "AJAX",
        "REST API"
      ],
      "softSkills": [
        "Problem Solving",
        "Team Collaboration",
        "Technical Documentation",
        "User Experience Design"
      ],
      "introduction": {
        "description": "As a key developer on the Apigem project, I led the modernization of their web application used by medical clinics for patient and staff management. The project involved transforming a legacy system into a modern, responsive web application while maintaining seamless integration with their existing desktop solution.",
        "introduction": "Apigem Web serves as a critical tool for medical staff, enabling them to manage patient records, staff schedules, and appointments. My role focused on improving the application's usability and accessibility while ensuring robust integration with their existing systems.",
        "name": "Apigem Web",
        "title": "Apigem"
      },
      "tasks": [
        {
          "group": {
            "titre": "System Architecture Modernization",
            "intro": "Led the transformation of the legacy system into a modern, maintainable architecture with improved performance and scalability."
          },
          "data": {
            "1": {
              "title": "Architecture Analysis and Planning",
              "description": [
                "Conducted comprehensive analysis of the existing legacy system architecture",
                "Identified performance bottlenecks in database queries and API calls",
                "Planned the implementation of a modern MVC architecture with REST API endpoints",
                "Designed a new database structure optimized for web application performance"
              ]
            },
            "2": {
              "title": "Core System Implementation",
              "description": [
                "Implemented a modular architecture using PHP namespaces and autoloading",
                "Developed a REST API layer for seamless integration with the desktop application",
                "Created an efficient caching system for frequently accessed data",
                "Implemented secure authentication and session management"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "User Interface Enhancement",
            "intro": "Transformed the user interface into a modern, responsive design with improved usability and accessibility."
          },
          "data": {
            "1": {
              "title": "Responsive Design Implementation",
              "description": [
                "Implemented Bootstrap 4 grid system for responsive layouts across all devices",
                "Created custom CSS components for consistent styling and branding",
                "Developed mobile-first design patterns for optimal user experience",
                "Implemented touch-friendly controls for tablet and mobile users"
              ]
            },
            "2": {
              "title": "Interactive Features Development",
              "description": [
                "Developed real-time updates using AJAX and WebSocket technology",
                "Implemented drag-and-drop functionality for appointment scheduling",
                "Created dynamic form validation with instant feedback",
                "Added keyboard shortcuts for power users"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Performance Optimization",
            "intro": "Significantly improved application performance through various optimization techniques."
          },
          "data": {
            "1": {
              "title": "Database Optimization",
              "description": [
                "Optimized database queries reducing response time by 60%",
                "Implemented query caching for frequently accessed data",
                "Created efficient indexing strategies for large datasets",
                "Developed a data archiving system for historical records"
              ]
            },
            "2": {
              "title": "Frontend Performance",
              "description": [
                "Implemented lazy loading for images and content",
                "Optimized JavaScript bundle size using code splitting",
                "Created efficient DOM manipulation patterns",
                "Implemented browser caching strategies"
              ]
            }
          }
        }
      ]
    },
    "bubo": {
      "description": "Led the modernization of a legacy PHP application to Symfony 4, implementing Material Design principles and advanced data visualization with ApexCharts",
      "img": "/images/project-images/bubo/logo.png",
      "mainTechnologies": [
        "Symfony",
        "UIkit",
        "GIT",
        "SQL",
        "DQL",
        "Yarn",
        "ApexCharts"
      ],
      "softSkills": [
        "Teamwork",
        "Data Visualization",
        "UI/UX Design",
        "Version Control"
      ],
      "introduction": {
        "description": "Led the complete modernization of a legacy PHP application, focusing on system architecture, user interface, and data visualization improvements",
        "introduction": "Modernized a legacy PHP application to meet current web standards and improve user experience",
        "name": "BUBO Cybsersec",
        "title": "BUBO"
      },
      "tasks": [
        {
          "group": {
            "titre": "System Modernization",
            "intro": "Led the migration from a legacy PHP application to Symfony 4, focusing on performance optimization and architectural improvements."
          },
          "data": {
            "1": {
              "title": "Legacy to Symfony Migration",
              "description": [
                "Conducted comprehensive analysis of performance bottlenecks and architectural limitations",
                "Designed new database structure and Doctrine entities for optimal integration",
                "Refactored PHP and JavaScript code for improved maintainability",
                "Implemented modern development practices and coding standards"
              ]
            },
            "2": {
              "title": "UI/UX Redesign",
              "description": [
                "Led UI/UX redesign adopting Material Design principles",
                "Selected and integrated UIkit via Yarn, customizing it for application needs",
                "Utilized Webpack Encore for asset management and optimization",
                "Designed consistent design system including horizontal navigation, custom components, and responsive dashboards"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Data Visualization Enhancement",
            "intro": "Replaced legacy charting system with ApexCharts for modern and interactive data visualization."
          },
          "data": {
            "1": {
              "title": "Interactive Charts Implementation",
              "description": [
                "Implemented charts with zoom functionality and export capabilities",
                "Added real-time updates and dynamic filtering features",
                "Created responsive and interactive data visualizations",
                "Optimized chart performance for large datasets"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Security Enhancement",
            "intro": "Integrated OpenVas for advanced vulnerability monitoring and implemented real-time security metrics."
          },
          "data": {
            "1": {
              "title": "Vulnerability Management",
              "description": [
                "Developed real-time vulnerability data processing and analysis system",
                "Designed robust database for historical vulnerability tracking",
                "Created interactive dashboards with real-time security metrics",
                "Implemented automated vulnerability assessment workflows"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Performance Optimization",
            "intro": "Implemented dynamic data loading and AJAX updates for optimal performance."
          },
          "data": {
            "1": {
              "title": "Data Loading Optimization",
              "description": [
                "Implemented dynamic data loading using KnpPaginator",
                "Created efficient sorting and filtering mechanisms for large datasets",
                "Optimized AJAX updates for real-time data refresh",
                "Improved overall application response time and user experience"
              ]
            }
          }
        }
      ]
    },
    "hml": {
      "description": "Optimized and modernized Mediabase, a key export and data processing platform for book distributors, focusing on automation, reliability, and performance.",
      "img": "/images/project-images/hml/logo.png",
      "mainTechnologies": [
        "PHP",
        "Zend",
        "Sphinx",
        "Ubuntu",
        "Apache",
        "MySQL",
        "Cron",
        "Docker",
        "Samba"
      ],
      "softSkills": [
        "Process Automation",
        "Data Processing",
        "Reliability",
        "Teamwork"
      ],
      "introduction": {
        "name": "Harmonia Mundi Livre",
        "introduction": "As the lead developer for Mediabase, I was responsible for two major system improvements: optimizing the existing template-based export system and developing a new customized export system. The project aimed to enhance data processing efficiency and provide more flexible export capabilities for users.",
        "description": "I led both the optimization of the existing template system and the development of a new customized export system, focusing on performance improvements, user experience, and advanced export features."
      },
      "tasks": [
        {
          "group": {
            "titre": "Template System Optimization",
            "intro": "Optimized the existing template-based export system to significantly improve performance and reliability, focusing on the PDF generation process using FPDF."
          },
          "data": {
            "performance": {
              "title": "Performance Analysis and Optimization",
              "description": [
                "Conducted thorough analysis of the existing template system's performance bottlenecks, particularly in the FPDF-based generation process",
                "Identified and resolved memory management issues in PDF generation, where each element was being generated pixel-by-pixel",
                "Implemented efficient data processing algorithms to handle large batches of PDF generation",
                "Reduced PDF generation time from one day to approximately 20 minutes by implementing template-based generation"
              ]
            },
            "template": {
              "title": "Template System Implementation",
              "description": [
                "Developed a robust template engine using pre-filled files with static covers and shapes (Template F and Template G)",
                "Created a flexible template management system that copies and modifies templates instead of generating from scratch",
                "Implemented caching mechanisms for improved performance and reduced memory usage",
                "Added support for various export formats and layouts, with automated notification system for completed exports"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Customized Export System Development",
            "intro": "Developed a new customized export system with advanced features and flexible configuration options, including dynamic field management and format selection."
          },
          "data": {
            "fields": {
              "title": "Dynamic Field Management",
              "description": [
                "Implemented a dynamic field selection system with category-based organization and permission checks",
                "Created a user-friendly interface for field configuration with drag-and-drop functionality",
                "Added support for custom field formatting and validation, including number, text, and list types",
                "Developed field dependency management system with automatic category hiding based on permissions"
              ]
            },
            "rights": {
              "title": "Advanced Rights Management",
              "description": [
                "Designed and implemented a granular permissions system for field access control",
                "Created role-based access control for export features with field-level permissions",
                "Developed export quota management system with usage tracking",
                "Implemented audit logging for export operations with detailed user activity tracking"
              ]
            },
            "formats": {
              "title": "Format Selection and Customization",
              "description": [
                "Developed support for multiple export formats (PDF, Excel, CSV) with format-specific optimizations",
                "Created format-specific configuration options with custom formatting rules",
                "Implemented format validation and preview features with real-time updates",
                "Added support for custom format templates with save and share capabilities"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Infrastructure Modernization",
            "intro": "Modernized the production environment to support both export systems efficiently, including migration to Ubuntu 22.04 and implementation of secure configurations."
          },
          "data": {
            "infrastructure": {
              "title": "System Analysis and Infrastructure Setup",
              "description": [
                "Analyzed current infrastructure using Zend Framework, Docker for search library, and Samba for file sharing",
                "Set up a modern production environment with Ubuntu 22.04 and optimized Apache configuration",
                "Implemented secure configurations and access controls for application and file sharing",
                "Created automated deployment and backup systems with comprehensive testing procedures"
              ]
            },
            "migration": {
              "title": "System Migration and Integration",
              "description": [
                "Planned and executed smooth migration of both export systems with zero downtime",
                "Ensured data integrity during migration process with automated validation",
                "Implemented monitoring and alerting systems for both export processes",
                "Created comprehensive documentation for both systems including setup and maintenance procedures"
              ]
            }
          }
        }
      ]
    },
    "hopps": {
      "description": "Led the development and maintenance of AlertCenter, a comprehensive IT infrastructure monitoring platform that provides real-time insights and incident management capabilities",
      "img": "/images/project-images/hopps/logo.png",
      "mainTechnologies": [
        "C#",
        "ASP.NET",
        "Powershell",
        "LDAP",
        "Webservices",
        "Jira"
      ],
      "softSkills": [
        "Autonomous Work",
        "Proactivity",
        "Responsiveness",
        "Initiative",
        "Communication"
      ],
      "introduction": {
        "description": "As a developer at Hopps Groupe, I worked on maintaining and enhancing their internal monitoring tools, particularly AlertCenter, which serves as a central platform for IT infrastructure monitoring and incident management.",
        "introduction": "AlertCenter is a critical tool used by the infrastructure department to monitor and manage IT systems. The platform integrates with various monitoring tools and provides real-time dashboards for incident tracking and escalation.",
        "name": "AlertCenter",
        "title": "Hopps Group"
      },
      "tasks": [
        {
          "group": {
            "titre": "Platform Enhancement",
            "intro": "Enhanced AlertCenter's capabilities as a central monitoring platform for IT infrastructure and incident management, focusing on real-time monitoring and efficient incident handling."
          },
          "data": {
            "1": {
              "title": "Monitoring Dashboard Development",
              "description": [
                "Developed a centralized dashboard aggregating data from multiple infrastructure monitoring tools",
                "Implemented real-time incident display with team-specific indicators and severity levels",
                "Created a comprehensive incident history and log viewing system with advanced filtering",
                "Added real-time metrics visualization with customizable time ranges"
              ]
            },
            "2": {
              "title": "System Modernization",
              "description": [
                "Modernized the codebase using object-oriented programming and MVC architecture",
                "Implemented WebSocket technology for real-time data updates without polling",
                "Enhanced webservice integrations for seamless data synchronization",
                "Developed an advanced incident escalation system with SMS and call notifications based on criticality"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Client Separation Project",
            "intro": "Successfully separated AlertCenter into two independent applications to support a client's separation from the main group, ensuring data isolation and maintaining functionality."
          },
          "data": {
            "1": {
              "title": "Multi-tenant Implementation",
              "description": [
                "Designed and implemented a multi-tenant architecture for separate client environments",
                "Developed request filtering system to maintain tool connectivity based on user accounts",
                "Created a more efficient solution to handle client separation requirements",
                "Implemented data isolation mechanisms to ensure client data privacy"
              ]
            },
            "2": {
              "title": "Access Control System",
              "description": [
                "Implemented account grouping with conditional filtering throughout the application",
                "Developed cross-server request filtering to maintain tool connectivity",
                "Created role-based access control with granular permissions",
                "Conducted comprehensive unit testing before client deployment"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Service Center Automation",
            "intro": "Created an efficient service center ticketing interface that bridges multiple systems and automates user management, significantly reducing manual intervention."
          },
          "data": {
            "1": {
              "title": "Service Desk Integration",
              "description": [
                "Developed a web-based form for CDS to create Jira tickets efficiently",
                "Implemented LDAP integration to pre-fill ticket information using personnel numbers",
                "Created a seamless workflow for ticket creation and management",
                "Added automated ticket categorization based on incident type"
              ]
            },
            "2": {
              "title": "Identity Management",
              "description": [
                "Built a bridge between two Active Directories and the Jira ticketing system",
                "Implemented automatic Jira account creation for new users via Jira API",
                "Developed a synchronization system for user roles and permissions",
                "Created automated user provisioning and deprovisioning workflows"
              ]
            }
          }
        }
      ]
    },
    "scf": {
      "description": "Developed a comprehensive web platform for the French-speaking SC community, providing localized content, real-time updates, and community features as an alternative to the English official website",
      "img": "/images/project-images/scf/logo.png",
      "mainTechnologies": [
        "Symfony",
        "UIkit",
        "API Platform",
        "SQL",
        "DQL",
        "Yarn",
        "Vue.js",
        "Docker"
      ],
      "softSkills": [
        "Fullstack Development",
        "API Design",
        "Teamwork",
        "Community Management"
      ],
      "introduction": {
        "description": "The game related to the site is under development, and all content is currently in English. We propose an alternative for the French-speaking community",
        "introduction": "Personal project to become an additional support for a community of 6000 users on a chat application (Discord)!",
        "name": "SC Francophone Web",
        "title": "SC Francophone"
      },
      "tasks": [
        {
          "group": {
            "titre": "Platform Development",
            "intro": "Built a modern web platform using React and Node.js, focusing on performance, scalability, and real-time features for the French-speaking community."
          },
          "data": {
            "1": {
              "title": "Core Architecture Implementation",
              "description": [
                "Developed a React-based frontend with server-side rendering for optimal performance",
                "Implemented a Node.js backend with RESTful API endpoints",
                "Created a MongoDB database structure optimized for content management",
                "Set up Docker containers for consistent development and deployment"
              ]
            },
            "2": {
              "title": "Real-time Features",
              "description": [
                "Implemented WebSocket integration for real-time updates and notifications",
                "Created a live chat system with Discord integration",
                "Developed real-time content synchronization across multiple servers",
                "Added push notifications for important community updates"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Content Management",
            "intro": "Developed an efficient content management system for handling game-related information and community content."
          },
          "data": {
            "1": {
              "title": "Data Integration",
              "description": [
                "Created automated data scraping system for game updates and news",
                "Implemented content translation pipeline for French localization",
                "Developed caching system using Redis for improved performance",
                "Built content validation and moderation tools"
              ]
            },
            "2": {
              "title": "Community Features",
              "description": [
                "Developed user profile system with Discord integration",
                "Created community forums with real-time updates",
                "Implemented content sharing and voting system",
                "Added moderation tools for community management"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Performance Optimization",
            "intro": "Implemented various optimization techniques to ensure fast loading times and smooth user experience."
          },
          "data": {
            "1": {
              "title": "Frontend Optimization",
              "description": [
                "Implemented code splitting and lazy loading for faster initial load",
                "Optimized image loading with WebP format and responsive images",
                "Created efficient state management with Redux",
                "Added service worker for offline functionality"
              ]
            },
            "2": {
              "title": "Backend Optimization",
              "description": [
                "Implemented database indexing for faster queries",
                "Created efficient caching strategies with Redis",
                "Developed load balancing for multiple servers",
                "Added monitoring and logging for performance tracking"
              ]
            }
          }
        }
      ]
    }
  }
}
