{
	"common": {
		"about": "About",
		"contact": "Contact",
		"home": "Home",
		"language": "Langue",
		"projects": "Projects",
		"seeMore": "See more",
		"selectLanguage": "Sélectionner la langue",
		"skills": "Skills"
	},
	"portfolio": {
		"description": "Bienvenue sur mon portfolio ! Vous trouverez ici une vitrine de mes compétences et de mon expérience.",
		"noProjects": "Aucun projet à afficher pour le moment.",
		"title": "Mon Portfolio"
	},
	"projects": {
		"apigem": {
			"description": "Redesign of the Apigem web application for improved ergonomics and accessibility",
			"img": "/src/public/images/project-images/apigem/logo.png",
			"introduction": {
				"description": "Apigem is a French company based in Saint Cannat, specializing in the development of software packages for the management of medical clinics. The Apigem information system enables better management of patients and staff through various modules accessible according to user profile.",
				"introduction": "Apigem Web is a web-based application for consulting staff schedules, patient operations and patient files. Apigem can also be used to manage and consult appointments.",
				"name": "Apigem web",
				"title": "Apigem"
			},
			"tasks": [
				{
					"data": {
						"1": {
							"description": [
								"- Study of the Apigem Set desktop application and the Apigem Web web application, both running on the same database, enabling interoperability between the two systems.",
								"- Native PHP application requires upgrading, and has a lot of redundancy"
							],
							"title": "The Apigem application"
						}
					},
					"group": {
						"intro": "intro intro",
						"titre": "Ecosystem analysis"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- Installation of a template engine to separate the view from a controller to facilitate application evolution",
								"- Installation of the Bootstrap plugin to make the website responsive"
							],
							"title": "Preparing for code updates"
						},
						"2": {
							"description": [
								"- Migration of the login page to a new design, integrating new functionalities.",
								"- Transformation of the vertical menu into a horizontal, responsive menu, grouping modules by family.",
								"- Implementation of a routing system with URL rewriting for cleaner, more secure navigation addresses.",
								"- Implementation of a routing system with URL rewriting for cleaner, more secure navigation addresses.\nFront pages and tables: Migration of the schedule display page, integration of an adaptive display for smartphones via JavaScript (jQuery), with a condition in the template engine to display data according to screen resolution."
							],
							"title": "Migration of first pages"
						},
						"3": {
							"description": [
								"- Migration of the planning page, with adaptive display for smartphones via JavaScript (jQuery).",
								"- Condition in template engine to display data according to screen resolution.",
								"- Redesigned calendar in jQuery, adding ergonomic viewing buttons for small screens.",
								"- Addition of a favorites feature for pages, saving the default page in the database."
							],
							"title": "Display of schedules and tables"
						}
					},
					"group": {
						"intro": "intro intro",
						"titre": "Migrating first pages"
					}
				}
			]
		},
		"bubo": {
			"description": "Develop a tool to monitor the information system (IS) of companies and improve its quality and data protection.",
			"img": "/src/public/images/project-images/bubo/logo.png",
			"introduction": {
				"description": "Objectif Cloud est une entreprise de Cyber Sécurité réalisant des prestations ayant pour vocation d’offrir une meilleure protection de la donnée et de l’information, et de prévenir les incidents de sécurité. En qualité de développeur, je réalise avec l'équipe, l'outil de supervision \"BUBO Sentry\" permettant aux entreprises d’avoir une vision globale de l’état de leur système d’information.",
				"introduction": "Le projet principal est la réalisation d’un outil de supervision pour les entreprises désirant renforcer la qualité de leur système d’information et la protection de leurs données. Il s’agit de proposer des indicateurs permettant de surveiller le S.I. comme, par exemple, des tableaux de bord dynamiques et efficaces donnant une vision globale sur le système d’information.",
				"name": "Bubo Cybersec",
				"title": "OBJECTIF CLOUD"
			},
			"tasks": [
				{
					"data": {
						"1": {
							"description": [
								"A website in native Php 7. An HTML CSS template. Dashboards and indicators. MySql database"
							],
							"title": "Analyze the existing"
						},
						"2": {
							"description": [
								"Objectives: Modernize, avoid redundancy. Object-oriented programming, MVC structure."
							],
							"img": "https://i.ibb.co/LS0T1Ng/oldgestuser.png",
							"title": "The choice of technology"
						},
						"3": {
							"description": [
								"Reuse of the existing (Php). Time saving. Templatize. Structure files. Webpack for assets."
							],
							"title": "From Bubo to Bubo Symfony"
						},
						"4": {
							"description": [
								"- Creation of the database for Symfony so that it can work with Doctrine.",
								"- Génération des entitées doctrines depuis une base de donnée existante.",
								"- Import assets to use them with WebPack and compile them for readability and performance reasons.",
								"- Repartition of php and javascript functions so as not to have to recreate the entire site and keep the existing one.."
							],
							"title": "Performing the refactoring"
						}
					},
					"group": {
						"intro": "This involves modernizing the site by refactoring it from a native PHP structure to Symfony 4.",
						"titre": "Refactoring"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- Analysis of the existing: Bootstrap plugin.",
								"- Advantages: Simple implementation, wab standards, quickly functional, responsive.",
								"- Disadvantages: theme difficult to customize. Already has an advanced design. Need an application-specific identity.",
								"- Comparison with UIkit, Sementic UI, Bootstrap.",
								"- Choice of UIkit because it focuses on structure rather than design. Material theme. Simple to evolve over time."
							],
							"title": "The choice of graphics plugin"
						},
						"2": {
							"description": [
								"- Use of the Yarn package manager to install the library.",
								"- Simple command line installation of plugins.",
								"- Disadvantages: theme difficult to customize. Already has an advanced design. Need an application-specific identity."
							],
							"title": "Installing UIkit"
						},
						"3": {
							"description": [
								"- Magical solution from Symfony to manage site assets.",
								"- Its configuration file to fill in the list of assets that you want to load like UIkit and its icon library.",
								"- Allows you to combine CSS and Javascript by reducing them into a public directory.",
								"- Then simply specify the webpack entry in the branch template.\n"
							],
							"img": "https://i.ibb.co/gVrbRTG/negestuser.png",
							"title": "The Webpack Encore plugin"
						},
						"4": {
							"description": [
								"- Creation of the skeleton of the site. Horizontal bar for menus, colors and choice of icons. Font and footer..",
								"- Updated counters in dahsboards. Speaking and refined visual with a material rendering.\t",
								"- The counter has a title, a numerical value on a white background with a shadow effect. The number of counters is defined by the size of each column.",
								"- Updated bootstrap tables to UIkit. Creation of a custom kit for all other components."
							],
							"img": "https://i.ibb.co/LS0T1Ng/oldgestuser.png",
							"title": "Setting up UIkit"
						},
						"5": {
							"description": [
								"- Analysis of the existing situation: curves in the application showing the evolution of the data.",
								"- Disadvantages: do not match the new design and future features.",
								"- Take advantage of the redesign of the design to evolve the curves. Installation with Yarn of Apex Charts (graph plugin based on graphJS).",
								"- Advantages: Modern curves, colorful, dynamically displayed and supporting JQuery. Ability to zoom in on a period and export.",
								"- Validation of data consistency"
							],
							"img": "https://kamalaityous.fr/img/portfolio/bubo/chartsfilt1.png",
							"title": "Change of charts plugin"
						}
					},
					"group": {
						"intro": "This involves modernizing the site by refactoring it from a native PHP structure to the Symfony 4 framework.",
						"titre": "Graphic redesign"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- Added a new indicator.",
								"- Use the application to exploit the raw data sent by the external tool OpenVas which is a vulnerability scanner.",
								"- Report the existence of a vulnerability and indicate whether it is necessary to take action to manage it."
							],
							"img": "https://i.ibb.co/d4H97jB/Mockup-Dasboard-Principal.jpg",
							"title": "Goals"
						},
						"2": {
							"description": [
								"- Analysis of the existing: the script, the structure of the table, the functional specifications and the graphic models.",
								"- Creation of the Symfony entity with Doctrine as well as the properties and relationships (vulnerability details, vulnerable systems).",
								"- I use the date of the vulnerability to know if it has appeared several times and to have a history of it.",
								"- Generation of modifications in the database. The data is implemented by the script. The generated repository allows access to it."
							],
							"img": "https://i.ibb.co/Ctd4CPH/gsv1.png",
							"title": "Database"
						},
						"3": {
							"description": [
								"- Updated the code of all tables in the application to optimize it and improve the user experience.",
								"- Initially, each table loads the entire data and simply reorganizes it with a simple sorting and pagination system.",
								"- After a study of the solutions available with Symfony to dynamically change the elements to display.",
								"- Implementation of Knp Paginator, a plugin that can load a number of data specified with parameters contained in the url, making it sortable and paginated.",
								"- If it requires reloading the page to call the url, I enhanced it with Ajax. The url is called dynamically with javascript making the loading invisible.",
								"- Sorting and pagination only reloads the table and not the page, with the number of elements chosen. It's faster, easier to use.",
								"- The next step was to disseminate these modifications throughout the site and the following functions."
							],
							"img": "https://i.ibb.co/W036tzf/thumbnail-Vuln-rabilit-s-Dashboard.png",
							"title": "Dynamic and paginated tables"
						},
						"4": {
							"description": [
								"- Creation of the vulnerability controller as well as the necessary routes and functions.",
								"- Creation of views. List of systems, their details. Details of system vulnerabilities.",
								"- Added the possibility of excluding a vulnerability so as not to take it into account when listing vulnerable systems.",
								"- Added many relevant metrics with numerical value, real-time trend arrow. At the click, you can filter the other information.",
								"- Added graphs such as TOP vulnerabilities, average vulnerabilities per machine."
							],
							"title": "Graphical views"
						}
					},
					"group": {
						"intro": "List vulnerabilities, scan machines, and identify vulnerable machines. Format data on dashboard.",
						"titre": "Added a new management indicator"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- After each development Sprint, carrying out a complete retesting. Highlight malfunctions and faults.",
								"- Plan corrections for the next Sprint.",
								"- In the event of a major modification, this is an evolution requiring a design phase."
							],
							"title": "Bug fix"
						},
						"2": {
							"description": [
								"- Significant development phase.",
								"- Generally thinking among several people about the technical base of a new development.",
								"- Agreeing on the vision of the evolution before planning it."
							],
							"title": "Design"
						},
						"3": {
							"description": [
								"- A major modification or the addition of a functionality.",
								"- An improvement for the application.",
								"- Usually requires a design phase and completed.",
								"- Retesting ensures its operation and conformity with what was planned."
							],
							"title": "Evolution"
						},
						"4": {
							"description": [
								"- Deploy the solution to pilot companies.",
								"- Obtain valuable feedback giving an opinion on the field of real need.",
								"- High added value for both parties."
							],
							"title": "Start of production at pilot companies"
						}
					},
					"group": {
						"intro": "Tasks performed daily as a developer.",
						"titre": "Continuous work"
					}
				}
			]
		},
		"hml": {
			"description": "Harmonia Mundi Livre est specialise dans la distribution de livre. Elle travail avec les libraires et les editeurs.",
			"img": "/src/public/images/project-images/hml/logo.png",
			"introduction": {
				"description": "Harmonia Mundi Livre is located in the culture sector, providing diffusion and distribution solutions to its partners.",
				"introduction": "Mediabase is the central tool used by salespeople and publishers for product referencing and the generation of commercial material.",
				"name": "Mediabase",
				"title": "Harmonia Mundi Livre"
			},
			"tasks": [
				{
					"data": [
						{
							"description": [
								"- Highlight the existing fields attached to each book and who can consult them in a spreadsheet",
								"- Display with a search field of all the list of all available and authorized fields ",
								"- Fields are grouped by category. If there are no rights for a field in the category, the fields and category are hidden."
							],
							"title": "Adding exportable custom fields"
						},
						{
							"description": [
								"- Possible addition of properties to each field, such as type (number, text, string...) and format (list, decimal, text...)",
								"- Creation of a generic modal with data display options {eg: trimming decimals, capitalizing, separation character for a list, etc.)",
								"- Open the modal to add, edit or delete a field in the list of selected fields."
							],
							"title": "Creation of generic parameter modal for a field to export"
						},
						{
							"description": [
								"- Added the ability to add, edit or delete a field in the list of selected fields",
								"- Added drag and drop to reorder fields, edit buttons and field deletion",
								"- Added options for saving and sharing lists, selecting export formats and launching export."
							],
							"title": "Managing selected fields"
						}
					],
					"group": {
						"intro": "Create an export model creation tool allowing you to export one or more fields on demand with the choice of data display format, in CSV, Excel, or even PDF format, via an intuitive interface.",
						"titre": "Redesign of custom data export"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- Try out several PDF export libraries based on an html exportable template.",
								"- Templating document pages by identifying those that will be repeated several times and adding variables to templates",
								"- First file generated, but relatively slow when adding covers and colored shapes containing the note",
								"- Real-condition testing with generation time history and change of generation method."
							],
							"title": "Le choix de la technologie"
						},
						"2": {
							"description": [
								"- Generation with FPDF pixel-by-pixel rather than from html",
								"- Real-time generation by executing a php command with almost a day's generation time"
							],
							"title": "Le choix de la technologie"
						}
					},
					"group": {
						"intro": "Generate a large number of PDF files containing text and numerous images, automatically followed by notification",
						"titre": "Generation of a restocking guide with FPDF"
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- Generation with FPDF pixel-by-pixel rather than from html",
								"- Real-time generation by executing a php command with almost a day's generation time"
							],
							"title": "Observing the slowness of execution"
						},
						"2": {
							"description": [
								"",
								"- Creation of a pre-filled file with covers and shapes called Template F and Template G that do not change during generation ",
								"- Since image generation takes the longest, all that's left to do is copy an F or G Template, edit it with FPDF and fill in the text. About twenty minutes are all that's needed.",
								"- After each group of files has been generated, we notify the librarian with the path to our share containing the PDF files for that group."
							],
							"title": "Templatization of the longest treatment"
						}
					},
					"group": {
						"intro": "Generation of a large number of pdf files allowing booksellers to view the top 50 HML restocking sales from the bookseller distribution channel.",
						"titre": "Optimization of the generation of a large number of pdf files "
					}
				},
				{
					"data": {
						"1": {
							"description": [
								""
							],
							"title": ""
						},
						"2": {
							"description": [
								""
							],
							"title": ""
						}
					},
					"group": {
						"intro": "",
						"titre": "Updated search with Sphinx and data indexing "
					}
				},
				{
					"data": {
						"1": {
							"description": [
								"- We had one ubuntu virtual machine for dev, and one for production. The latter was an old version",
								"- We use Zend as the programming language, docker to manage the search library and samba for file sharing"
							],
							"title": "Analysis of existing systems"
						},
						"2": {
							"description": [
								"- Create a new VM with a newer Ubuntu version",
								"- Installing Apache and the database server"
							],
							"title": "Server and services installation"
						},
						"3": {
							"description": [
								"- After importing the site files, set the database parameters ",
								"- Configuration of vhost files to secure application access and ensure availability",
								"- Installation of file sharing with Samba and unit testing to ensure seamless updates"
							],
							"title": "Installation of existing systems"
						}
					},
					"group": {
						"intro": "Creation of a new Mediabase production web server to replace the old one, to reinforce security and improve maintainability",
						"titre": "Creation and maintenance of the web infrastructure"
					}
				}
			]
		},
		"hopps": {
			"description": "Hopps Groupe in the distribution sector needs tools to supervise its IT infrastructure like AlertCenter",
			"img": "/src/public/images/project-images/hopps/logo.png",
			"introduction": {
				"description": "Hopps Groupe has many needs in terms of software and applications. Their tools are mostly developed in-house and need to be maintained because they are so important.",
				"introduction": "Maintenance and evolution of cloud tools. The company's internal tools, particularly those used by engineers in the infrastructure department, were developed in-house.\nThey are connected to business applications, and they need to evolve over time as required.",
				"name": "Hopps Group",
				"title": "AlertCenter"
			},
			"tasks": [
				{
					"data": {
						"1": {
							"description": [
								"- The IT department has many infra monitoring tools, and AlertCenter gathers the information they send in the form of a dashboard.",
								"- Display of current incidents for each team and level in the form of indicators",
								"- Select an incident to view its history and logs."
							],
							"title": "Control of internal processes for alerting and escalating incidents reported by business applications."
						},
						"2": {
							"description": [
								"Objectives: Modernize, avoid redundancy. Object-oriented programming, MVC structure.",
								"- I ensured the operation of the webservices and code updates,",
								"- Develops the escalation of incidents and on-call calls generated by the application.",
								"- Improved on-call system generated by the application, which can send an SMS or a call depending on criticality"
							],
							"title": "The choice of technology"
						}
					},
					"group": {
						"intro": "AlertCenter is a dashboard developed in ASP.NET that uses webservices to interconnect various incident escalation applications. Its incident interface webservice enables incidents to be escalated to the right person in the right department.",
						"titre": "Maintaining and enhancing cloud tools"
					}
				},
				{
					"data": [
						{
							"description": [
								"- Create a new server or install a second version of AlertCenter",
								"- Filtering of requests on both servers to keep tools connected according to the connected account",
								"- I realized that the project would be difficult to carry out in this way and proposed a quicker and safer solution."
							],
							"title": "Creation of a second ALC version"
						},
						{
							"description": [
								"- Creation of an account group. Add conditional filters throughout the application",
								"- Filter requests on both servers to keep tools connected",
								"- Extensive unit testing before going live with customer"
							],
							"title": "Link the form to Jira"
						}
					],
					"group": {
						"intro": "One of the company's subsidiaries decided to separate from the group and continue to benefit from the AlertCenter application and incident reports. I explore solutions and implement the project ",
						"titre": "Split AlertCenter into two applications for an external client"
					}
				},
				{
					"data": [
						{
							"description": [
								"- Creation of a form enabling CDS to create Jira tickets from the web",
								"- The fields are pre-filled in the ticket with information from the personnel number using LDAP.- The fields are pre-filled in the ticket with information from the personnel number using LDAP."
							],
							"title": "The CDS form"
						},
						{
							"description": [
								"- This form is a bridge between two active directories and the Jira ticketing tool.",
								"- On-the-fly creation of a Jira account if the ticket requester does not exist in Jira via the Jira API"
							],
							"title": "Link the form to Jira"
						}
					],
					"group": {
						"intro": "The service center needs to create tickets on the Jira application quickly for users in two different Active Directories. We need to be able to find them via the user number and create a Jira account automatically if they don't have one, and create the ticket.",
						"titre": "Service Center ticketing interface"
					}
				}
			]
		},
		"scf": {
			"description": "Additional referencing support for the French-speaking community as an alternative to the English official website",
			"img": "/src/public/images/project-images/scf/logo.png",
			"introduction": {
				"description": "The game related to the site is under development, and all content is currently in English. We propose an alternative for the French-speaking community ",
				"introduction": "Personal project to become an additional support for a community of 6000 users on a chat application (Discord)!",
				"name": "Star Citizen Francophone Web",
				"title": "Star Citizen Francophone"
			},
			"tasks": [
				{
					"data": [
						{
							"description": [
								"- Create a referencing space for French-speaking users and French-speaking organizations coming from Discord.",
								"- Make adding data simple and automatic using a data scrapper.",
								"- Create useful and modular tools such as fleet management, event creation and consultation of a wiki.",
								"- Keep an application compatible with other technologies thanks to the ingestion of an API in V2."
							],
							"title": "Missions"
						}
					],
					"group": {
						"intro": "Create a complete and useful application for an already existing community with known needs.",
						"titre": "Key Features"
					}
				},
				{
					"data": [
						{
							"description": [
								"- The Scrapper service uses a url and the service to retrieve the page from a site. The service parse using regular expressions.",
								"- The item or list of usable items returned by the service is recorded by the “Cacher” service, which uses the data and stores it in the database.",
								"- Redesign to meet current web criteria (responsibe, modern appearance...).",
								"- Templatization of the site's web pages via a template engine. Remove all redundancy."
							],
							"title": "Data Interceptor"
						},
						{
							"description": [
								"- When registering, the user enters his nickname on the official site.",
								"- Using the “synchronize from profile” page, the user can use the interceptor service.",
								"- The service fetches the user's profile page from the official site and extracts all public data.",
								"- A verification step ensures that it is indeed your profile that will be saved.",
								"- The database is then updated with these data, and they are now visible on our site."
							],
							"title": "Users"
						},
						{
							"description": [
								"- Organization Management retrieves data on the user's organization, and whether or not he or she is its leader.",
								"- Fleet retrieves ship data from a public wiki, and a new feature lets you manage your ships on our site."
							],
							"title": "Other modules"
						}
					],
					"group": {
						"intro": "Data Interceptor est un service de l’application. Il est issue de l’api http://sc-api.com/ open source qui a été adaptée ici afin qu’elle soit utilisé comme service. Ainsi, nous n’appelons plus de route, il n’y a plus d’api. Nous utilisons directement les fonctions du service.",
						"titre": "The data scraper"
					}
				},
				{
					"data": [
						{
							"description": [
								"- Evolution of site controllers, returning a json response instead of a view.",
								"- Secure api with JWT authentication (token) on routes.",
								"- Configuration of dto objects (data transfer object) to customize returned objects into complex objects.",
								"- Integration of pagination for objects and object arrays returned by the api."
							],
							"title": "Realization of the secure api"
						},
						{
							"description": [
								"- The site is in full api so it can be extended to any web, mobile or desktop platform.",
								"- Creation of a Vue 3 front-end to exteranlize the visual part of the site. This takes over the functions of the basic site.",
								"- Creation of a modern, responsive design and api call with Axios."
							],
							"title": "Front-end in Vue 3"
						}
					],
					"group": {
						"intro": "Data Interceptor est un service de l’application. Il est issue de l’api http://sc-api.com/ open source qui a été adaptée ici afin qu’elle soit utilisé comme service. Ainsi, nous n’appelons plus de route, il n’y a plus d’api. Nous utilisons directement les fonctions du service.",
						"titre": "The data scraper"
					}
				}
			]
		}
	}
}
