{
  "common": {
    "about": "À propos",
    "abouthelloim": "Bonjour, je suis",
    "aboutp1": "👨‍💻 Avec de nombreuses années d'expérience dans le développement web, je me spécialise dans le Back-End, les applications métier et le développement de logiciels sur mesure.",
    "aboutp2": "✅ Que vous ayez besoin de développer une application web complexe, de mettre en place un système de gestion efficace ou d'améliorer les performances de votre site existant, je suis là pour vous accompagner à chaque étape, de la conception à la livraison, au déploiement et à la maintenance.",
    "aboutp3": "💬 Contactez-moi maintenant pour discuter de votre projet et commençons à travailler ensemble pour atteindre vos objectifs !",
    "contact": "Contact",
    "contactme": "Me contacter",
    "getresume": "CV",
    "getresumefile": "FR_CV_KamalAITYOUS.pdf",
    "home": "Accueil",
    "language": "Langue",
    "main1": "Faites de votre application web",
    "main2": "Une réalité",
    "projects": "Projets",
    "seeMore": "Voir plus",
    "selectLanguage": "Sélectionner une langue",
    "skills": "Compétences",
    "sub1": "Vous cherchez un développeur freelance polyvalent pour vous aider\n            dans vos projets web ?",
    "sub2": "Vous êtes au bon endroit !",
    "technologies": "Technologies :",
    "softSkills": "Soft Skills :",
    "projectContext": "Contexte du Projet",
    "myRole": "Mon Rôle",
    "keyActions": "Actions Clés & Impact",
    "keyChallenges": "Défis Clés",
    "solutionsImplemented": "Solutions Mises en Œuvre",
    "externalLinks": "Liens Externes"
  },
  "portfolio": {
    "description": "Bienvenue sur mon portfolio ! Vous trouverez ici une vitrine de mes compétences et de mon expérience.",
    "noProjects": "Aucun projet à afficher pour le moment.",
    "title": "Mon Portfolio"
  },
  "projects": {
    "apigem": {
      "description": "Refonte de l'application web Apigem pour une meilleure ergonomie et accessibilité",
      "img": "/images/project-images/apigem/logo.png",
      "mainTechnologies": ["PHP", "Bootstrap", "jQuery", "MySQL"],
      "softSkills": [
        "Résolution de problèmes",
        "Collaboration d'équipe",
        "Documentation technique",
        "Design d'expérience utilisateur"
      ],
      "introduction": {
        "description": "Apigem est une entreprise française basée à Saint Cannat, spécialisée dans le développement de progiciels pour la gestion des cliniques médicales. Le système d'information Apigem permet une meilleure gestion des patients et du personnel grâce à différents modules accessibles selon le profil utilisateur.",
        "introduction": "Apigem Web est une application web permettant de consulter les plannings du personnel, les opérations des patients et les dossiers patients. Apigem permet également de gérer et consulter les rendez-vous.",
        "name": "Apigem web",
        "title": "Apigem"
      },
      "tasks": [
        {
          "data": {
            "1": {
              "description": [
                "- Étude de l'application de bureau Apigem Set et de l'application web Apigem Web, toutes deux fonctionnant sur la même base de données, permettant une interopérabilité entre les deux systèmes.",
                "- L'application en PHP natif nécessite une montée de version, et possède beaucoup de redondance"
              ],
              "title": "L'application Apigem"
            }
          },
          "group": {
            "intro": "",
            "titre": "Analyse de l'écosystème"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Installation d'un moteur de template pour séparer la vue d'un contrôleur pour faciliter l'évolution de l'application",
                "- Installation du plugin Bootstrap pour rendre le site web responsive"
              ],
              "title": "Préparation a la mise a jour du code"
            },
            "2": {
              "description": [
                "- Migration de la page login vers un nouveau design, intégration des nouvelles fonctionnalités.",
                "- Transformation du menu vertical en un menu horizontal et responsive, regroupant les modules par familles.",
                "- Mise en place d'un système de routage avec réécriture des URL pour des adresses de navigation plus propres et sécurisées.",
                "- Migration de la page d'affichage des plannings, intégration d'un affichage adaptatif pour les smartphones via JavaScript (jQuery), avec condition dans le moteur de templates pour afficher les données en fonction de la résolution de l'écran."
              ],
              "title": "Migration des premières pages"
            },
            "3": {
              "description": [
                "- Migration de la page de planification, avec un affichage adaptatif pour smartphones via JavaScript (jQuery).",
                "- Condition dans le moteur de templates pour afficher les données en fonction de la résolution de l'écran.",
                "- Refonte du calendrier en jQuery, ajout de boutons de visualisation ergonomiques pour petits écrans.",
                "- Ajout d'une fonctionnalité de favoris pour les pages, enregistrant la page par défaut dans la base de données."
              ],
              "title": "Affichage des plannings et tableaux"
            }
          },
          "group": {
            "intro": "",
            "titre": "Migration des premières pages"
          }
        }
      ]
    },
    "bubo": {
      "description": "Développer un outil pour surveiller le système d'information (SI) des entreprises et améliorer sa qualité et la protection des données.",
      "img": "/images/project-images/bubo/logo.png",
      "mainTechnologies": ["Symfony 4", "PHP", "UIkit", "MySQL", "Webpack"],
      "softSkills": [
        "Architecture système",
        "Leadership technique",
        "Refactorisation de code",
        "Optimisation des performances"
      ],
      "introduction": {
        "description": "Objectif Cloud est une entreprise de Cyber Sécurité proposant des services conçus pour offrir une meilleure protection des données et des informations, et pour prévenir les incidents de sécurité. En tant que développeur, j'ai travaillé avec l'équipe pour créer l'outil de supervision \"BUBO Sentry\", donnant aux entreprises une vue globale de l'état de leurs systèmes d'information.",
        "introduction": "Le projet principal est la création d'un outil de supervision pour les entreprises souhaitant renforcer la qualité de leur système d'information et la protection de leurs données. L'objectif est de proposer des indicateurs pour le suivi du S.I., comme des tableaux de bord dynamiques et efficaces donnant une vue d'ensemble du système d'information.",
        "name": "Bubo Cybersec",
        "title": "OBJECTIF CLOUD"
      },
      "tasks": [
        {
          "data": {
            "1": {
              "description": [
                "Un site web en Php 7 natif. Un template HTML CSS. Des tableaux de bord et des indicateurs. BDD MySql"
              ],
              "title": "Analyser de l'existant"
            },
            "2": {
              "description": [
                "Objectifs : Moderniser, éviter la redondence. Progammation orientée objet, structure MVC."
              ],
              "img": "/images/project-images/bubo/oldgestuser.png",
              "title": "Le choix de la technologie"
            },
            "3": {
              "description": [
                "Réutilisation de l'existant (Php). Gain de temps. Templatiser. Structurer les fichiers. Webpack pour les assets."
              ],
              "title": "De Bubo à Bubo Symfony"
            },
            "4": {
              "description": [
                "- Création de la base de donnée pour Symfony afin qu'elle puisse fonctionner avec Doctrine.",
                "- Génération des entitées doctrines depuis une base de donnée existante.",
                "- Importation des assets pour les utiliser avec WebPack et les compiler pour des raisons de lisibilité et de performences.",
                "- Rappartieement des fonctions php et javascript afin de ne pas avoir à recréer tout le site et garder l'existant.."
              ],
              "title": "Réalisation de la refactorisation"
            }
          },
          "group": {
            "intro": "Il s'agit de moderniser le site en le refactorisant d'une structure PHP native vers Symfony 4.",
            "titre": "Refactorisation"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Analyse de l'existant : plugin Bootstrap.",
                "- Aventages : Implémentation simple, standards du wab, rapidement fonctionnel, responsive.",
                "- Inconvénients : thème difficile à personnaliser. Possède déjà un design avancé. Besoin d'une identité propre à l'application.",
                "- Comparaison avec UIkit, Sementic UI, Bootstrap.",
                "- Choix d'UIkit car se concentre sur la structure plutot que le design. Thème Material. Simple à faire évoluer avec le temps."
              ],
              "title": "Le choix du plugin graphique"
            },
            "2": {
              "description": [
                "- Utilisation du gestionnaire de packages Yarn pour installer le librairie.",
                "- Installation simple des plugins en ligne de commande.",
                "- Inconvénients : thème difficile à personnaliser. Possède déjà un design avancé. Besoin d'une identité propre à l'application."
              ],
              "title": "Installation d'UIkit"
            },
            "3": {
              "description": [
                "- Solution magique de Symfony pour gérer les assets du site.",
                "- A son fichier de configuration pour renseigner la liste des assets que l'on veut charger comme UIkit et sa librairie d'icones.",
                "- Permet de complier le CSS et le Javascript en les allégeant dans un repértoire public.",
                "- En suite il suffit de pécifier l'entrée webpack dans le template twig..\n"
              ],
              "img": "/images/project-images/bubo/negestuser.png",
              "title": "Le plugin Webpack Encore"
            },
            "4": {
              "description": [
                "- Réalisation du squelette du site. Bar horizontale pour les menus, couleurs et choix des icons. Police d'écriture et pied de page..",
                "- Mise à jour des compteurs dans les dahsboard. Visuel parlant et épuré avec un rendu matérial.\t",
                "- Le compteur possède un titre, une valeur numérique sur fond blanc avec un effet d'ombre. Le nombre de compteurs est défini par la taille de chaques colonnes.",
                "- Mise à jour des tableaux bootstrap vers UIkit. Création d'un kit personnalisé pour tous les autres composants."
              ],
              "img": "/images/project-images/bubo/oldgestuser.png",
              "title": "Mise en place d'UIkit"
            },
            "5": {
              "description": [
                "- Analyse de l'existant : des courbes dans l'application montrant l'évolution des données.",
                "- Inconvéniants : ne correspondent pas au nouveau design et aux futures fonctionnalités.",
                "- Profiter de la refonte du design pour faire évoluer les courbes. Installation avec Yarn d'Apex Charts (plugin graphique basé sur graphJS).",
                "- Avantages : Courbes modernes, colorés, affichées dynamyqment et supportant JQuery. Possibilité de zoomer sur une période et d'exporter.",
                "- Validation de la cohérence des données"
              ],
              "img": "/images/project-images/bubo/chartsfilt1.png",
              "title": "Changement de plugin charts"
            }
          },
          "group": {
            "intro": "Il s'agit de moderniser le site en le refactorisant d'une structure PHP native vers le framework Symfony 4.",
            "titre": "Refonte graphique"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Ajout d'un nouvel indicateur.",
                "- Exploiter grace à l'application les données brutes envoyé par l'outil externe OpenVas qui est un scanneur de vulnérabilité.",
                "- Signaler l'existance d'une vulnérabilité et signalier s'il est nécaéssaire de réaliser une action pour la gérer."
              ],
              "img": "/images/project-images/bubo/Mockup-Dasboard-Principal.jpg",
              "title": "Objectifs"
            },
            "2": {
              "description": [
                "- Analyse de l'existant : le script, la structure de la table, les spéficiations fonctionnelles et les maquettes graphiques.",
                "- Création de l'entité Symfony avec Doctrine ainsi que les propriétés et les relations (détail de la vulnérabilité, systèmes vulnérables).",
                "- J'utilise la date de la vulnérabilité pour savoir si elle est apparu plusieurs fois et avoir un historique de celle ci.",
                "- Génération des modifications dans la base de données. Les données sont implémentés par le script. Le répository généré permet d'y accéder."
              ],
              "img": "/images/project-images/bubo/gsv1.png",
              "title": "Base de données"
            },
            "3": {
              "description": [
                "- Mise à jour du code de tous les tableaux de l'application pour l'optimisser et améliorer l'expérience utilisateur.",
                "- Initialement, chaque tableau charge l'entièreté des données et se contente de les réorganiser avec un simple système de tris et de pagination.",
                "- Après une étude des solution disponnibles avec Symfony pour chager dynamiquement les éléments à afficher.",
                "- Implémentation de Knp Paginator, plugin pouvant charger un nombre de données spécifiées avec des paramètres contenus dans l'url en rendant triable, et paginé.",
                "- S'il nécéssite de recharger la page pour apepler l'url, je l'ai étoffé avec Ajax. L'url est appelé dynamiquement avec javascript rendant le chargement invisible.",
                "- Le tri et la paagination rechargent uniquement le tabelau et non la page, avec le nombre d'élément choisis. C'est plus rapide, plus simple à utiliser.",
                "- La suite a été de diffuser ces modifications sur l'ensemble du site et les fonctions suivantes."
              ],
              "img": "/images/project-images/bubo/thumbnail-Vuln-rabilit-s-Dashboard.png",
              "title": "Les tableaux dynamiques et paginés"
            },
            "4": {
              "description": [
                "- Création du contrôleur des vulnérabilités ainsi que des routes et fonctions nécéssaires.",
                "- Réalisation des vues. Liste des systèmes, leur détail. Détail des vulnérabilités d'un système.",
                "- Ajout de la possibilité d'exclure une vulnérabilité pour ne pas la prendre en compte lors du listage des systèmes vulnérables.",
                "- Ajout de nombreuses métriques pertinentes avec une valeur numérique, une flèche de tendance en temps réel. Au clique, peuvent filtrer les autres informations.",
                "- Ajout de graphiques comme le TOP des vulnérabilités, moyenne de vulnérabilités par machines."
              ],
              "title": "Les vues graphiques"
            }
          },
          "group": {
            "intro": "Répertorier les vulnérabilités, scanner des machines, et identifier les machines vulnérabes. Formater les données sur le tableau de bord.",
            "titre": "Ajout d'un nouvel indicateur de gestion"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Après chaque Sprint de développement, réalisation d'un recettage compèlet. Mettre en évidence disfonctionnements, fautes.",
                "- Planifier les corrections pour le Sprint suivant.",
                "- En cas de modification majeure, il s'agit d'évolution nécéssitant une phase de conception."
              ],
              "title": "Correction de bug"
            },
            "2": {
              "description": [
                "- Phase de développement non négligeable.",
                "- Réflexion généralement à plusieurs quant au socle technique d'une nouvelle évlution.",
                "- Mise en accord sur la vision de l'évolution avant sa planification."
              ],
              "title": "Conception"
            },
            "3": {
              "description": [
                "- Une modification majeure ou bien l'ajout d'une fonctionnalité.",
                "- Une amélioration pour l'application.",
                "- Nécéssite généralement une phase de conception et terminé.",
                "- Le recettage permet d'assurer son fonctionnement et sa conformité avec ce qui a été prévu."
              ],
              "title": "Evolution"
            },
            "4": {
              "description": [
                "- Déployer la solution chez des entreprises pilotes.",
                "- Obtenir des retours précieux donnant un avis sur le terrain du besoin réel.",
                "- Forte valeur ajoutée pour les deux parties."
              ],
              "title": "Mise en production chez des entreprises pilotes"
            }
          },
          "group": {
            "intro": "Tâches réalisées quotidiennement en tant que développeur.",
            "titre": "Travail en continue"
          }
        }
      ]
    },
    "hml": {
      "description": "Harmonia Mundi Livre est spécialisée dans la distribution de livres. Elle travaille avec des libraires et des éditeurs.",
      "img": "/images/project-images/hml/logo.png",
      "mainTechnologies": ["PHP", "MySQL", "JavaScript", "HTML/CSS"],
      "softSkills": [
        "Analyse de données",
        "Optimisation des processus métier",
        "Communication client",
        "Gestion de projet"
      ],
      "introduction": {
        "description": "Harmonia Mundi Livre est située dans le secteur culturel, fournissant des solutions de diffusion et de distribution à ses partenaires.",
        "introduction": "Mediabase est l'outil central utilisé par les commerciaux et les éditeurs pour le référencement des produits et la génération de matériel commercial.",
        "name": "Mediabase",
        "title": "Harmonia Mundi Livre"
      },
      "tasks": [
        {
          "data": [
            {
              "description": [
                "- Mise en évidence des champs existant rattachés a chaque livre et qui peux les consulter dans un tableur",
                "- Affichage avec un champ recherche de tous la liste de tous les champs disponibles et autorisés ",
                "- Les champs sont regroupes par catégories. Si aucun droit pour un champ dans la catégorie, on masque les champs et la catégorie"
              ],
              "title": "Ajout des champs personnalises exportables"
            },
            {
              "description": [
                "- Ajout de propriété possible a chaque champ, comme le type (nombre, texte, chaîne de caractère...) et de format (liste, décimal, texte...)",
                "- Création d'une modale générique avec des options d'affichage de la donnée {ex : rogner des décimales, mettre en majuscule, caractère de séparation pour une liste ...)",
                "- Ouverture du modal a l'ajout, édition ou suppression d'un champ dans la liste des champs sélectionnés"
              ],
              "title": "Création de modal générique de paramètre d'un champ a exporter"
            },
            {
              "description": [
                "- Ajout de la possibilité d'ajouter, éditer ou supprimer un champ dans la liste des champs sélectionnés",
                "- Ajout de drag and drop pour réorganiser les champs, de boutons d'édition et suppression de champ",
                "- Ajout d'option de sauvegarde et partage de la liste, de sélection de format d'export et la possibilité de lancer l'export"
              ],
              "title": "Gestion des champs sélectionnés"
            }
          ],
          "group": {
            "intro": "Créer un outil de création de model d'export permettant d'exporter a la demande un ou plusieurs champs avec le choix du format d'affichage de la donnée, au format CSV, Excel, ou encore PDF, via une interface intuitive.",
            "titre": "Refonte de l'export de données personnaliser"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Essaie de plusieurs libraire d'export PDF d'après une maquette exportable au format html",
                "- Templétisation des pages du document en identifiant celles qui seront répétés plusieurs fois et ajout des variables au templates",
                "- Génération du premier fichier mais relativement lente lors de l'ajout des couvertures et des formes colores contenant la note",
                "- Test en condition réel en historisant le temps de génération et changement de méthode de génération."
              ],
              "title": ""
            },
            "2": {
              "description": [
                "- Génération avec FPDF au pixel près de chaque éléments plutôt que depuis le html",
                "- Génération en condition réel via l'exécution d'une commande php avec presque une journée de génération"
              ],
              "title": ""
            }
          },
          "group": {
            "intro": "Générer un grand nombre de fichier PDF comportant du texte et de nombreuses images, générés de façon automatique suivie d'une notification",
            "titre": "Géneration d'un guide du réassort avec FPDF"
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Génération avec FPDF au pixel près de chaque éléments plutôt que depuis le html",
                "- Génération en condition réel via l'exécution d'une commande php avec presque une journée de génération"
              ],
              "title": "Constatation de la lenteur d'exécution"
            },
            "2": {
              "description": [
                "",
                "- Création d'un fichier pré-remplis avec les couvertures et les formes appelés Template F et Template G qui ne changent pas pendant la génération ",
                "- La génération des images étant le plus long, il ne reste qu'a copier un Template F ou G et de l'editer a l'aide de FPDF et de remplir le texte. Une vingtaine de minute suffisent.",
                "- Après la génération de chaque groupe de fichier, on notifie le libraire avec le chemin sur notre partage contenant les fichiers PDF le concernant"
              ],
              "title": "Templatisation du traitement le plus long"
            }
          },
          "group": {
            "intro": "Generation d'un grand nombre de fichiers pdf permetant aux libraires de visualiser le top 50 des ventes réassort HML du canal de distribution libraire.",
            "titre": "Optimisation de la génération d'un grand nombre de fichiers pdf "
          }
        },
        {
          "data": {
            "1": {
              "description": [""],
              "title": ""
            },
            "2": {
              "description": [""],
              "title": ""
            }
          },
          "group": {
            "intro": "",
            "titre": "Mise à jour de la recherche avec Sphinx et l'indexation des données "
          }
        },
        {
          "data": {
            "1": {
              "description": [
                "- Nous avions une machine virtuelle ubuntu pour la dev, et une pour la production. Ce dernier étant dans une vieille version",
                "- Nous utilisons Zend comme langage de programmation, docker pour gérer la librairie de recherche et samba pour le partage de fichier"
              ],
              "title": "Analyse de l'existant"
            },
            "2": {
              "description": [
                "- Création d'une nouvelle VM avec une version d'Ubuntu plus récentes",
                "- Installation d'Apache et du serveur de base de données"
              ],
              "title": "Installation du serveur et des services"
            },
            "3": {
              "description": [
                "- Après avoir importe les fichiers du site, paramétrage de la base de données ",
                "- Configuration des fichiers vhost pour sécuriser l'accès a l'application et assurer sa disponibilité",
                "- Installation du partage de fichier avec Samba et test unitaires afin d'assurer la mise a jour sans effets de bords"
              ],
              "title": "Installation de l'existant"
            }
          },
          "group": {
            "intro": "Création d'un nouveau serveur web de production de la Mediabase pour remplacer l'ancien afin de renforcer la sécurité et améliorer la maintenabilité",
            "titre": "Création et maintenance de l'infrastructure web"
          }
        }
      ]
    },
    "hopps": {
      "description": "Hopps Groupe dans le secteur de la distribution a besoin d'outils pour superviser son infrastructure informatique comme AlertCenter avec des tableaux de bord",
      "img": "/images/project-images/hopps/logo.png",
      "mainTechnologies": ["PHP", "MySQL", "JavaScript", "Bootstrap"],
      "softSkills": [
        "Intégration système",
        "Support technique",
        "Documentation",
        "Coordination d'équipe"
      ],
      "introduction": {
        "description": "Hopps Groupe a de nombreux besoins en termes de logiciels et d'applications. Leurs outils sont principalement développés en interne et doivent être maintenus car ils sont très importants.",
        "introduction": "Maintenance et évolution des outils cloud. Les outils internes de l'entreprise, notamment ceux utilisés par les ingénieurs du département infrastructure, ont été développés en interne.\nIls sont connectés aux applications métier, et ils doivent évoluer dans le temps selon les besoins.",
        "name": "Hopps Group",
        "title": "AlertCenter"
      },
      "tasks": [
        {
          "data": {
            "1": {
              "description": [
                "- Le service informatique a de nombreux outils de supervision de l'infra et AlertCenter réunis les informations qu'ils envoie sous forme de tableau de bord",
                "- Affichage des incidents en cours pour chaque équipe et niveau sous forme d'indicateurs",
                "- Possibilité de sélectionner un incident pour avoir l'historique et les logs de celui ci."
              ],
              "title": "AlertCenter, le tableau de bord de supervision central"
            },
            "2": {
              "description": [
                "Objectifs : Moderniser, éviter la redondance. Programmation orientée objet, structure MVC.",
                "- J'ai assurer le fonctionnement des webservices et les mises a jour du code,",
                "- Effectue une évolution au niveau de l'escalade des incidents Ainsi que des appels astreintes générés par l'application",
                "- Amélioration du systèmes appels astreintes générés par l'application pouvant envoyer un sms ou un appel selon la criticité"
              ],
              "title": "Le webservice Interface Incident"
            }
          },
          "group": {
            "intro": "AlertCenter est un tableau de bord développe en ASP.NET et qui utilise des webservices pour inter-connecter diverses applications de remontée d'incident. Son webservice interface incident permet l'escalade des incident a la bonne personne au bon service",
            "titre": "Maintiens et évolution des outils du cloud"
          }
        },
        {
          "data": [
            {
              "description": [
                "- Création d'un nouveau serveur ou j'installe une deuxième version d'AlertCenter",
                "- Filtrage des requêtes sur les deux serveurs afin de garder les outils connectes selon le compte connecte",
                "- Je réalise que le projet est difficilement réalisable ainsi et propose une solution plus rapide et plus sure"
              ],
              "title": "Creation d'une seconde version ALC"
            },
            {
              "description": [
                "- Création d'un groupe de compte. On ajoute des filtres conditionnels un peu partout dans l'application",
                "- Filtrage des requêtes sur les deux serveurs afin de garder les outils connectes",
                "- Nombreux tests unitaires avant la mise en production avec le client"
              ],
              "title": "Modification des droits de visualisation via la gestion de droits"
            }
          ],
          "group": {
            "intro": "Une filiale de l'entreprise se sépare du groupe décide continuer de bénéficier de l'application AlertCenter et des remontées d'incident. J'explore les solutions et réalise le projet ",
            "titre": "Séparer AlertCenter en deux appli pour un client externe"
          }
        },
        {
          "data": [
            {
              "description": [
                "- Création d'un formulaire permettant au CDS de créer des tickets Jira depuis le web",
                "- Les champs sont pré-remplis dans le ticket par les informations via le matricule avec LDAP"
              ],
              "title": "Le formulaire pour le CDS"
            },
            {
              "description": [
                "- Ce formulaire est un pont entre deux active directory et l'outil de ticketing Jira",
                "- Création d'un compte Jira a la volée si le demandeur du ticket n'existe pas dans Jira via l'API Jira"
              ],
              "title": "Relier le formulaire a Jira"
            }
          ],
          "group": {
            "intro": "Le centre de service a besoin de créer des tickets sur l'application Jira rapidement pour des utilisateurs présents sur deux Active Directory différents. On doit pouvoir les retrouver via le matricule et créer un comte Jira automatiquement s'il n'en a pas, et créer le ticket.",
            "titre": "Interface de ticketing Centre De Service"
          }
        }
      ]
    },
    "scf": {
      "description": "Support supplémentaire de référencement pour la communauté francophone comme alternative au site officiel en anglais",
      "img": "/images/project-images/scf/logo.png",
      "mainTechnologies": ["React", "Node.js", "MongoDB", "Discord API"],
      "softSkills": [
        "Gestion de communauté",
        "Intégration d'API",
        "Scraping de données",
        "Design d'expérience utilisateur"
      ],
      "introduction": {
        "description": "Le jeu en rapport avec le site est en développement, et tous les contenus sont en anglais actuellement. Nous proposons une alternative pour la communauté francophone",
        "introduction": "Projet personnel visant à devenir un support supplémentaire pour une communauté de 6000 utilisateurs sur une application de tchat (Discord) !",
        "name": "Star Citizen Francophone Web",
        "title": "Star Citizen Francophone"
      },
      "tasks": [
        {
          "data": [
            {
              "description": [
                "- Créer un espace de référencement des utilisateurs francophones et des organisations francophones venant du Discord.",
                "- Rendre l'ajout des données simple et automatiques à l'aide d'un scrappeur de données.",
                "- Créer des outils utiles et modulaires tels que la gestion de flottes, création d'évenements et consultation d'un wiki.",
                "- Garder une application compatible avec d'autres technologies grace à l'ingration d'une api dans la V2."
              ],
              "title": "Missions"
            }
          ],
          "group": {
            "intro": "Créer une application complète et utile pour une communauté déjà existante avec des besoins connus.",
            "titre": "FONCTIONNALITÉ CLÉS"
          }
        },
        {
          "data": [
            {
              "description": [
                "- Le service Scrapper récupère à l'aide d'une url et du service la page d'un site. Le service parse à l'aide d'expression régulière.",
                "- L'item ou la liste d'items exploitables retournées par le service sont enregistrés par le service \"Cacher\" qui exploite les données et les enregistres en base.",
                "- Refonte du design pour répondre aux critères actuels du web (responsibe, apparence moderne...).",
                "- Templatisation des pages web du site via un moteur de template. Enlever toute la redondence."
              ],
              "title": "Data Interceptor"
            },
            {
              "description": [
                "- A l'inscription, l'utilisateur saisie son pseudo sur le site officiel",
                "- A l'aide de la page \"synchroniser depuis son profil, il peut utiliser le service interceptor",
                "- Refonte du design pour répondre aux critères actuels du web (responsibe, apparence moderne...).",
                "- Une étape de vérification permet d'assurer que c'est bien son profil qui sera enregistré.",
                "- La base de données et mises à jour avec ces données et elles sont désormais visibles sur notre site."
              ],
              "title": "Utilisateurs"
            },
            {
              "description": [
                "- Gestion des organisations récupère les données de l'organisation de l'utilisateur et sait si il en est le leader ou non.",
                "- Fleet récupère des données sur des vaisseaux sur un wiki public, et une fonctionnalité permet de gérer ses vaisseaux sur notre site."
              ],
              "title": "Autres modules"
            }
          ],
          "group": {
            "intro": "Data Interceptor est un service de l'application. Il est issue de l'api http://sc-api.com/ open source qui a été adaptée ici afin qu'elle soit utilisé comme service. Ainsi, nous n'appelons plus de route, il n'y a plus d'api. Nous utilisons directement les fonctions du service.",
            "titre": "Le scrappeur de données"
          }
        },
        {
          "data": [
            {
              "description": [
                "- Évolution des contrôleurs du site, retournent un réponse json au lieu d'une vue.",
                "- Sécurisation de l'api avec une authentification JWT (token) sur les routes.",
                "- Configuration d'objets dto (data transfert objet) afin de pouvoir personnaliser les objets retournées en objets complexes.",
                "- Intégration de pagination pour les objets et tableaux d'objets retournés par l'api."
              ],
              "title": "Réalisation de l'api sécurisé"
            },
            {
              "description": [
                "- Le site est en full api pour pouvoir l'étendre sur n'importe quelle plateforme web, mobile ou bureau.",
                "- Création d'un front Vue 3 pour externaliser la partie visuelle du site. Celle ci reprend les fonctions du site de base.",
                "- Création d'un design moderne, responsive et appel de l'api avec Axios."
              ],
              "title": "Réalisation d'un front en Vue 3"
            }
          ],
          "group": {
            "intro": "Refactorisation de l'application avec une API pour gérer les données et un front-end React pour plus de performance et de modernité.",
            "titre": "Separation du front et du back"
          }
        }
      ]
    }
  }
}
