{
  "common": {
    "about": "À propos",
    "abouthelloim": "Bonjour, je suis",
    "aboutp1": "👨‍💻 Avec de nombreuses années d'expérience dans le développement web, je me spécialise dans le Back-End, les applications métier et le développement de logiciels sur mesure.",
    "aboutp2": "✅ Que vous ayez besoin de développer une application web complexe, de mettre en place un système de gestion efficace ou d'améliorer les performances de votre site existant, je suis là pour vous accompagner à chaque étape, de la conception à la livraison, au déploiement et à la maintenance.",
    "aboutp3": "💬 Contactez-moi maintenant pour discuter de votre projet et commençons à travailler ensemble pour atteindre vos objectifs !",
    "about_rich": "Bonjour,\n\n💻 Avec plusieurs années d'expérience en développement web, j'ai travaillé auprès de grands groupes et de startups dans des secteurs variés tels que la distribution, l'innovation et la cybersécurité. Je suis spécialisé dans le back-end, les applications de gestion et le développement de logiciels sur mesure.\n\n✅ Que vous ayez besoin de développer une application web complexe, de mettre en place un système de gestion performant ou d'améliorer les performances de votre site existant, je suis là pour vous accompagner à chaque étape du processus, de la conception à la livraison, en passant par le déploiement et la maintenance.\n💻 Développement web : Je développe de nouvelles fonctionnalités, assure la maintenance et l'évolution de l'existant, et corrige les bugs. Avec mon expertise en ASP.NET, PHP et les frameworks Symfony, CakePHP et Zend, je vous offre des solutions sur mesure adaptées à vos besoins.\n🔌 Connexion d'API : Je peux intégrer des applications tierces pour enrichir vos solutions web ou créer votre propre API pour interconnecter vos applications, améliorant ainsi l'efficacité et la productivité de vos systèmes.\n🔧 Refactorisation : Je restructure et optimise le code existant pour faciliter la maintenance et l'évolution, tout en améliorant la lisibilité et la performance de votre application.\n🎨 Refonte graphique : Je conçois des interfaces utilisateur modernes et réactives, offrant une expérience utilisateur optimale adaptée à toutes les tailles d'écran.\n🌐 Gestion de serveurs web : Je mets en place et configure des infrastructures de serveurs web performantes et sécurisées, ou vous aide à changer de nom de domaine.\n💬 Contactez moi dès maintenant pour discuter de votre projet et travaillons ensemble pour atteindre vos objectifs !",
    "contact": "Contact",
    "contactme": "Me contacter",
    "getresume": "CV",
    "getresumefile": "FR_CV_KamalAITYOUS.pdf",
    "home": "Accueil",
    "language": "Langue",
    "main1": "Faites de votre application web",
    "main2": "Une réalité",
    "projects": "Projets",
    "seeMore": "Voir plus",
    "selectLanguage": "Sélectionner une langue",
    "skills": "Compétences",
    "skills_search_placeholder": "Rechercher une technologie ou compétence...",
    "skills_search_aria": "Rechercher une compétence",
    "skills_mastered_tooltip": "Maîtrisé",
    "more_skills_aria": "Afficher {{count}} compétences supplémentaires : {{skills}}",
    "sub1": "Vous cherchez un développeur freelance polyvalent pour vous aider\n            dans vos projets web ?",
    "sub2": "Vous êtes au bon endroit !",
    "technologies": "Technologies :",
    "softSkills": "Soft Skills :",
    "projectContext": "Contexte du Projet",
    "myRole": "Mon Rôle",
    "keyActions": "Actions Clés & Impact",
    "keyChallenges": "Défis Clés",
    "solutionsImplemented": "Solutions Mises en Œuvre",
    "externalLinks": "Liens Externes",
    "skills_category_Backend": "Back-end",
    "skills_category_Frontend": "Front-end",
    "skills_category_Fullstack": "Fullstack",
    "skills_category_DevOps": "DevOps",
    "skills_category_Data": "Données",
    "skills_category_Other": "Autres",
    "skills_category_SoftSkills": "Soft Skills",
    "skills_other_agile": "Méthode Agile",
    "skills_other_webdesign": "Conception Web",
    "read_more": "En savoir plus",
    "show_less": "Réduire",
    "skills_desc.Teamwork": "Capacité à travailler efficacement en équipe.",
    "skills_desc.Team Collaboration": "Collaboration efficace au sein d'une équipe.",
    "skills_desc.Problem Solving": "Analyse et résolution de problèmes complexes.",
    "skills_desc.Technical Documentation": "Rédaction et gestion de documentation technique.",
    "skills_desc.User Experience Design": "Conception d'interfaces accessibles et centrées utilisateur.",
    "skills_desc.Data Visualization": "Présentation claire et impactante des données.",
    "skills_desc.UI/UX Design": "Conception d'interfaces modernes et responsives.",
    "skills_desc.Version Control": "Gestion des versions et du code collaboratif.",
    "skills_desc.Leadership Technique": "Encadrement technique d'équipes et de projets.",
    "skills_desc.Architecture Système": "Conception d'architectures robustes et évolutives.",
    "skills_desc.Optimisation des Performances": "Amélioration de la rapidité et de l'efficacité des applications.",
    "skills_desc.Fullstack Development": "Expérience en développement front-end et back-end.",
    "skills_desc.API Design": "Conception d'API robustes et évolutives.",
    "skills_desc.Community Management": "Animation et gestion de communautés d'utilisateurs.",
    "skills_desc.Process Automation": "Automatisation de tâches et de processus répétitifs.",
    "skills_desc.Data Processing": "Traitement et transformation efficace des données.",
    "skills_desc.Reliability": "Assurer la fiabilité et la robustesse des systèmes.",
    "skills_desc.Autonomous Work": "Capacité à travailler de façon autonome.",
    "skills_desc.Proactivity": "Prise d'initiative et anticipation des besoins.",
    "skills_desc.Responsiveness": "Réactivité et adaptation rapide.",
    "skills_desc.Initiative": "Capacité à initier et mener des actions.",
    "skills_desc.Communication": "Transmission claire et efficace des informations.",
    "skills_desc.Force de proposition": "Capacité à proposer des idées et des solutions.",
    "skills_desc.Travail en autonomie": "Capacité à travailler de façon indépendante.",
    "skills_desc.Réactivité": "Réagir rapidement et efficacement.",
    "skills_desc.Automatisation des processus": "Mise en place de solutions pour automatiser les tâches.",
    "skills_desc.Traitement de données": "Gestion et transformation efficace des données.",
    "skills_desc.Fiabilité": "Garantir la stabilité et la robustesse des systèmes.",
    "skills_category_All": "Tous",
    "project_nav_next": "Projet suivant",
    "project_nav_prev": "Projet précédent",
    "project_tasks_title": "TÂCHES RÉALISÉES"
  },
  "portfolio": {
    "description": "Bienvenue sur mon portfolio ! Vous trouverez ici une vitrine de mes compétences et de mon expérience.",
    "noProjects": "Aucun projet à afficher pour le moment.",
    "title": "Mon Portfolio"
  },
  "projects": {
    "apigem": {
      "description": "Dirigé la refonte complète de l'application web Apigem, en mettant l'accent sur les principes modernes d'UI/UX et le design responsive pour améliorer l'expérience utilisateur et l'accessibilité",
      "img": "/images/project-images/apigem/logo.png",
      "mainTechnologies": [
        "PHP",
        "Bootstrap",
        "jQuery",
        "MySQL",
        "AJAX",
        "REST API"
      ],
      "softSkills": [
        "Résolution de problèmes",
        "Collaboration d'équipe",
        "Documentation technique",
        "Design d'expérience utilisateur"
      ],
      "introduction": {
        "description": "En tant que développeur principal sur le projet Apigem, j'ai dirigé la modernisation de leur application web utilisée par les cliniques médicales pour la gestion des patients et du personnel. Le projet consistait à transformer un système legacy en une application web moderne et responsive tout en maintenant une intégration transparente avec leur solution desktop existante.",
        "introduction": "Apigem Web sert d'outil essentiel pour le personnel médical, leur permettant de gérer les dossiers patients, les plannings du personnel et les rendez-vous. Mon rôle s'est concentré sur l'amélioration de l'ergonomie et de l'accessibilité de l'application tout en assurant une intégration robuste avec leurs systèmes existants.",
        "name": "Apigem Web",
        "title": "Apigem"
      },
      "tasks": [
        {
          "group": {
            "titre": "Modernisation de l'Architecture Système",
            "intro": "Dirigé la transformation du système legacy en une architecture moderne et maintenable avec des performances et une évolutivité améliorées."
          },
          "data": {
            "1": {
              "title": "Analyse et Planification de l'Architecture",
              "description": [
                "Réalisé une analyse complète de l'architecture du système legacy existant",
                "Identifié les goulots d'étranglement de performance dans les requêtes base de données et les appels API",
                "Planifié l'implémentation d'une architecture MVC moderne avec des endpoints REST API",
                "Conçu une nouvelle structure de base de données optimisée pour les performances de l'application web"
              ]
            },
            "2": {
              "title": "Implémentation du Système Core",
              "description": [
                "Implémenté une architecture modulaire utilisant les namespaces PHP et l'autoloading",
                "Développé une couche REST API pour une intégration transparente avec l'application desktop",
                "Créé un système de cache efficace pour les données fréquemment accédées",
                "Implémenté une gestion sécurisée de l'authentification et des sessions"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Amélioration de l'Interface Utilisateur",
            "intro": "Transformé l'interface utilisateur en un design moderne et responsive avec une ergonomie et une accessibilité améliorées."
          },
          "data": {
            "1": {
              "title": "Implémentation du Design Responsive",
              "description": [
                "Implémenté le système de grille Bootstrap 4 pour des layouts responsifs sur tous les appareils",
                "Créé des composants CSS personnalisés pour un style et une identité cohérents",
                "Développé des patterns de design mobile-first pour une expérience utilisateur optimale",
                "Implémenté des contrôles adaptés au tactile pour les utilisateurs tablette et mobile"
              ]
            },
            "2": {
              "title": "Développement des Fonctionnalités Interactives",
              "description": [
                "Développé des mises à jour en temps réel utilisant la technologie AJAX et WebSocket",
                "Implémenté la fonctionnalité drag-and-drop pour la planification des rendez-vous",
                "Créé une validation dynamique des formulaires avec retour instantané",
                "Ajouté des raccourcis clavier pour les utilisateurs avancés"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Optimisation des Performances",
            "intro": "Amélioré significativement les performances de l'application grâce à diverses techniques d'optimisation."
          },
          "data": {
            "1": {
              "title": "Optimisation de la Base de Données",
              "description": [
                "Optimisé les requêtes base de données réduisant le temps de réponse de 60%",
                "Implémenté le cache des requêtes pour les données fréquemment accédées",
                "Créé des stratégies d'indexation efficaces pour les grands ensembles de données",
                "Développé un système d'archivage des données pour les enregistrements historiques"
              ]
            },
            "2": {
              "title": "Performance Frontend",
              "description": [
                "Implémenté le chargement différé pour les images et le contenu",
                "Optimisé la taille du bundle JavaScript en utilisant le code splitting",
                "Créé des patterns efficaces de manipulation du DOM",
                "Implémenté des stratégies de cache navigateur"
              ]
            }
          }
        }
      ]
    },
    "bubo": {
      "description": "Dirigé la modernisation d'une application PHP legacy vers Symfony 4, implémentant les principes du Material Design et une visualisation avancée des données avec ApexCharts",
      "img": "/images/project-images/bubo/logo.png",
      "mainTechnologies": [
        "Symfony",
        "PHP",
        "JavaScript",
        "UIkit",
        "Material Design",
        "ApexCharts",
        "OpenVas",
        "Webpack Encore"
      ],
      "softSkills": [
        "Leadership Technique",
        "Architecture Système",
        "Design UI/UX",
        "Optimisation des Performances"
      ],
      "introduction": {
        "description": "Dirigé la modernisation complète d'une application PHP legacy, en se concentrant sur l'architecture système, l'interface utilisateur et l'amélioration de la visualisation des données",
        "introduction": "Modernisé une application PHP legacy pour répondre aux standards web actuels et améliorer l'expérience utilisateur",
        "name": "BUBO Cybersec",
        "title": "Objectif Cloud"
      },
      "tasks": [
        {
          "group": {
            "titre": "Modernisation Système",
            "intro": "Dirigé la migration d'une application PHP legacy vers Symfony 4, en se concentrant sur l'optimisation des performances et les améliorations architecturales."
          },
          "data": {
            "1": {
              "title": "Migration Legacy vers Symfony",
              "description": [
                "Réalisé une analyse approfondie des goulots d'étranglement de performance et des limitations architecturales",
                "Conçu une nouvelle base de données et des entités Doctrine pour une intégration optimale",
                "Refactorisé le code PHP et JavaScript pour une meilleure maintenabilité",
                "Implémenté des pratiques de développement modernes et des standards de code"
              ]
            },
            "2": {
              "title": "Refonte UI/UX",
              "description": [
                "Dirigé la refonte UI/UX en adoptant les principes du Material Design",
                "Sélectionné et intégré UIkit via Yarn, en le personnalisant pour les besoins de l'application",
                "Utilisé Webpack Encore pour la gestion et l'optimisation des assets",
                "Conçu un système de design cohérent, incluant navigation horizontale, composants personnalisés et tableaux de bord responsifs"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Amélioration de la Visualisation des Données",
            "intro": "Remplacé le système de graphiques legacy par ApexCharts pour une visualisation moderne et interactive."
          },
          "data": {
            "1": {
              "title": "Implémentation des Graphiques Interactifs",
              "description": [
                "Implémenté des graphiques avec zoom et fonctionnalités d'export",
                "Ajouté des mises à jour en temps réel et des filtres dynamiques",
                "Créé des visualisations de données responsives et interactives",
                "Optimisé les performances des graphiques pour les grands ensembles de données"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Renforcement de la Sécurité",
            "intro": "Intégré OpenVas pour une surveillance avancée des vulnérabilités et implémenté des métriques de sécurité en temps réel."
          },
          "data": {
            "1": {
              "title": "Gestion des Vulnérabilités",
              "description": [
                "Développé un système de traitement et d'analyse des données de vulnérabilité en temps réel",
                "Conçu une base de données robuste pour le suivi historique des vulnérabilités",
                "Créé des tableaux de bord interactifs avec des métriques de sécurité en temps réel",
                "Implémenté des workflows automatisés d'évaluation des vulnérabilités"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Optimisation des Performances",
            "intro": "Implémenté le chargement dynamique des données et les mises à jour AJAX pour des performances optimales."
          },
          "data": {
            "1": {
              "title": "Optimisation du Chargement des Données",
              "description": [
                "Implémenté le chargement dynamique des données avec KnpPaginator",
                "Créé des mécanismes de tri et de filtrage efficaces pour les grands ensembles de données",
                "Optimisé les mises à jour AJAX pour le rafraîchissement en temps réel",
                "Amélioré le temps de réponse global de l'application et l'expérience utilisateur"
              ]
            }
          }
        }
      ]
    },
    "hml": {
      "description": "Optimisation et modernisation de Mediabase, plateforme clé d'export et de traitement de données pour les distributeurs de livres, axée sur l'automatisation, la fiabilité et la performance.",
      "img": "/images/project-images/hml/logo.png",
      "mainTechnologies": [
        "PHP",
        "Zend",
        "Sphinx",
        "Ubuntu",
        "Apache",
        "MySQL",
        "Cron",
        "Docker",
        "Samba"
      ],
      "softSkills": [
        "Automatisation des processus",
        "Traitement de données",
        "Fiabilité",
        "Travail d'équipe"
      ],
      "introduction": {
        "name": "Harmonia Mundi Livre",
        "introduction": "En tant que développeur principal pour Mediabase, j'étais responsable de deux améliorations majeures du système : l'optimisation du système d'export basé sur des modèles existant et le développement d'un nouveau système d'export personnalisé. Le projet visait à améliorer l'efficacité du traitement des données et à fournir des capacités d'export plus flexibles pour les utilisateurs.",
        "description": "J'ai dirigé à la fois l'optimisation du système de modèles existant et le développement d'un nouveau système d'export personnalisé, en me concentrant sur les améliorations de performance, l'expérience utilisateur et les fonctionnalités d'export avancées."
      },
      "tasks": [
        {
          "group": {
            "titre": "Optimisation du Système de Modèles",
            "intro": "Optimisé le système d'export basé sur des modèles existant pour améliorer significativement les performances et la fiabilité, en se concentrant sur le processus de génération PDF utilisant FPDF."
          },
          "data": {
            "performance": {
              "title": "Analyse et Optimisation des Performances",
              "description": [
                "Réalisé une analyse approfondie des goulots d'étranglement de performance du système de modèles existant, particulièrement dans le processus de génération basé sur FPDF",
                "Identifié et résolu les problèmes de gestion de la mémoire dans la génération de PDF, où chaque élément était généré pixel par pixel",
                "Implémenté des algorithmes efficaces de traitement des données pour gérer de grands lots de génération de PDF",
                "Réduit le temps de génération des PDF d'une journée à environ 20 minutes en implémentant la génération basée sur des modèles"
              ]
            },
            "template": {
              "title": "Implémentation du Système de Modèles",
              "description": [
                "Développé un moteur de modèles robuste utilisant des fichiers pré-remplis avec des couvertures et formes statiques (Modèle F et Modèle G)",
                "Créé un système flexible de gestion des modèles qui copie et modifie les modèles au lieu de générer à partir de zéro",
                "Implémenté des mécanismes de mise en cache pour améliorer les performances et réduire l'utilisation de la mémoire",
                "Ajouté la prise en charge de divers formats et mises en page d'export, avec un système de notification automatisé pour les exports terminés"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Développement du Système d'Export Personnalisé",
            "intro": "Développé un nouveau système d'export personnalisé avec des fonctionnalités avancées et des options de configuration flexibles, incluant la gestion dynamique des champs et la sélection de format."
          },
          "data": {
            "fields": {
              "title": "Gestion Dynamique des Champs",
              "description": [
                "Implémenté un système de sélection dynamique des champs avec organisation par catégories et vérification des permissions",
                "Créé une interface utilisateur intuitive pour la configuration des champs avec fonctionnalité de glisser-déposer",
                "Ajouté la prise en charge du formatage et de la validation personnalisés des champs, incluant les types nombre, texte et liste",
                "Développé un système de gestion des dépendances entre champs avec masquage automatique des catégories basé sur les permissions"
              ]
            },
            "rights": {
              "title": "Gestion Avancée des Droits",
              "description": [
                "Conçu et implémenté un système de permissions granulaire pour le contrôle d'accès aux champs",
                "Créé un contrôle d'accès basé sur les rôles pour les fonctionnalités d'export avec permissions au niveau des champs",
                "Développé un système de gestion des quotas d'export avec suivi de l'utilisation",
                "Implémenté un système de journalisation des opérations d'export avec suivi détaillé des activités utilisateur"
              ]
            },
            "formats": {
              "title": "Sélection et Personnalisation des Formats",
              "description": [
                "Développé la prise en charge de multiples formats d'export (PDF, Excel, CSV) avec optimisations spécifiques aux formats",
                "Créé des options de configuration spécifiques aux formats avec règles de formatage personnalisées",
                "Implémenté des fonctionnalités de validation et d'aperçu des formats avec mises à jour en temps réel",
                "Ajouté la prise en charge de modèles de format personnalisés avec capacités de sauvegarde et de partage"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Modernisation de l'Infrastructure",
            "intro": "Modernisé l'environnement de production pour supporter efficacement les deux systèmes d'export, incluant la migration vers Ubuntu 22.04 et l'implémentation de configurations sécurisées."
          },
          "data": {
            "infrastructure": {
              "title": "Analyse du Système et Configuration de l'Infrastructure",
              "description": [
                "Analysé l'infrastructure actuelle utilisant Zend Framework, Docker pour la bibliothèque de recherche et Samba pour le partage de fichiers",
                "Mis en place un environnement de production moderne avec Ubuntu 22.04 et configuration Apache optimisée",
                "Implémenté des configurations sécurisées et des contrôles d'accès pour l'application et le partage de fichiers",
                "Créé des systèmes automatisés de déploiement et de sauvegarde avec procédures de test complètes"
              ]
            },
            "migration": {
              "title": "Migration et Intégration du Système",
              "description": [
                "Planifié et exécuté une migration fluide des deux systèmes d'export sans interruption de service",
                "Assuré l'intégrité des données pendant le processus de migration avec validation automatisée",
                "Implémenté des systèmes de surveillance et d'alerte pour les deux processus d'export",
                "Créé une documentation complète pour les deux systèmes incluant les procédures de configuration et de maintenance"
              ]
            }
          }
        }
      ]
    },
    "hopps": {
      "description": "Dirigé le développement et la maintenance d'AlertCenter, une plateforme complète de surveillance d'infrastructure IT qui fournit des insights en temps réel et des capacités de gestion des incidents",
      "img": "/images/project-images/hopps/logo.png",
      "mainTechnologies": [
        "C#",
        "ASP.NET",
        "Powershell",
        "LDAP",
        "Webservices",
        "Jira"
      ],
      "softSkills": [
        "Travail en autonomie",
        "Force de proposition",
        "Réactivité",
        "Initiative",
        "Communication"
      ],
      "introduction": {
        "description": "En tant que développeur chez Hopps Groupe, j'ai travaillé sur la maintenance et l'amélioration de leurs outils de surveillance internes, notamment AlertCenter, qui sert de plateforme centrale pour la surveillance de l'infrastructure IT et la gestion des incidents.",
        "introduction": "AlertCenter est un outil critique utilisé par le département infrastructure pour surveiller et gérer les systèmes IT. La plateforme s'intègre avec divers outils de surveillance et fournit des tableaux de bord en temps réel pour le suivi et l'escalade des incidents.",
        "name": "AlertCenter",
        "title": "Hopps Group"
      },
      "tasks": [
        {
          "group": {
            "titre": "Amélioration de la Plateforme",
            "intro": "Amélioré les capacités d'AlertCenter en tant que plateforme centrale de surveillance de l'infrastructure IT et de gestion des incidents, en se concentrant sur la surveillance en temps réel et la gestion efficace des incidents."
          },
          "data": {
            "1": {
              "title": "Développement du Tableau de Bord de Surveillance",
              "description": [
                "Développé un tableau de bord centralisé agrégant les données de plusieurs outils de surveillance d'infrastructure",
                "Implémenté un affichage en temps réel des incidents avec des indicateurs spécifiques par équipe et niveaux de sévérité",
                "Créé un système complet d'historique des incidents et de visualisation des logs avec filtrage avancé",
                "Ajouté une visualisation des métriques en temps réel avec des plages de temps personnalisables"
              ]
            },
            "2": {
              "title": "Modernisation du Système",
              "description": [
                "Modernisé la base de code en utilisant la programmation orientée objet et l'architecture MVC",
                "Implémenté la technologie WebSocket pour des mises à jour en temps réel sans polling",
                "Amélioré les intégrations webservice pour une synchronisation transparente des données",
                "Développé un système avancé d'escalade des incidents avec notifications SMS et appel selon la criticité"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Projet de Séparation Client",
            "intro": "Séparé avec succès AlertCenter en deux applications indépendantes pour supporter la séparation d'un client du groupe principal, assurant l'isolation des données et le maintien des fonctionnalités."
          },
          "data": {
            "1": {
              "title": "Implémentation Multi-tenant",
              "description": [
                "Conçu et implémenté une architecture multi-tenant pour des environnements clients séparés",
                "Développé un système de filtrage des requêtes pour maintenir la connectivité des outils selon les comptes utilisateurs",
                "Créé une solution plus efficace pour gérer les besoins de séparation client",
                "Implémenté des mécanismes d'isolation des données pour assurer la confidentialité des données client"
              ]
            },
            "2": {
              "title": "Système de Contrôle d'Accès",
              "description": [
                "Implémenté le regroupement de comptes avec filtrage conditionnel dans toute l'application",
                "Développé le filtrage des requêtes cross-serveur pour maintenir la connectivité des outils",
                "Créé un contrôle d'accès basé sur les rôles avec des permissions granulaire",
                "Conduit des tests unitaires complets avant le déploiement client"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Automatisation du Centre de Service",
            "intro": "Créé une interface de ticketing efficace pour le centre de service qui connecte plusieurs systèmes et automatise la gestion des utilisateurs, réduisant significativement l'intervention manuelle."
          },
          "data": {
            "1": {
              "title": "Intégration du Service Desk",
              "description": [
                "Développé un formulaire web pour que le CDS crée efficacement des tickets Jira",
                "Implémenté l'intégration LDAP pour pré-remplir les informations de ticket avec les numéros de personnel",
                "Créé un workflow transparent pour la création et la gestion des tickets",
                "Ajouté une catégorisation automatique des tickets basée sur le type d'incident"
              ]
            },
            "2": {
              "title": "Gestion des Identités",
              "description": [
                "Construit un pont entre deux Active Directories et le système de ticketing Jira",
                "Implémenté la création automatique de comptes Jira pour les nouveaux utilisateurs via l'API Jira",
                "Développé un système de synchronisation des rôles et permissions utilisateurs",
                "Créé des workflows automatisés de provisionnement et déprovisionnement des utilisateurs"
              ]
            }
          }
        }
      ]
    },
    "scf": {
      "description": "Développé une plateforme web complète pour la communauté francophone de SC, fournissant du contenu localisé, des mises à jour en temps réel et des fonctionnalités communautaires comme alternative au site officiel en anglais",
      "img": "/images/project-images/scf/logo.png",
      "mainTechnologies": [
        "Symfony",
        "UIkit",
        "API Platform",
        "SQL",
        "DQL",
        "Yarn",
        "Vue.js",
        "Docker"
      ],
      "softSkills": [
        "Développement Fullstack",
        "Conception d'API",
        "Travail d'équipe",
        "Gestion de communauté"
      ],
      "introduction": {
        "description": "Le jeu en rapport avec le site est en développement, et tous les contenus sont en anglais actuellement. Nous proposons une alternative pour la communauté francophone",
        "introduction": "Projet personnel visant à devenir un support supplémentaire pour une communauté de 6000 utilisateurs sur une application de tchat (Discord) !",
        "name": "SC Francophone Web",
        "title": "SC Francophone"
      },
      "tasks": [
        {
          "group": {
            "titre": "Développement de la Plateforme",
            "intro": "Construit une plateforme web moderne utilisant React et Node.js, en se concentrant sur la performance, l'évolutivité et les fonctionnalités en temps réel pour la communauté francophone."
          },
          "data": {
            "1": {
              "title": "Implémentation de l'Architecture Core",
              "description": [
                "Développé un frontend React avec rendu côté serveur pour une performance optimale",
                "Implémenté un backend Node.js avec des endpoints API RESTful",
                "Créé une structure de base de données MongoDB optimisée pour la gestion de contenu",
                "Mis en place des conteneurs Docker pour un développement et déploiement cohérents"
              ]
            },
            "2": {
              "title": "Fonctionnalités en Temps Réel",
              "description": [
                "Implémenté l'intégration WebSocket pour les mises à jour et notifications en temps réel",
                "Créé un système de chat en direct avec intégration Discord",
                "Développé la synchronisation de contenu en temps réel sur plusieurs serveurs",
                "Ajouté des notifications push pour les mises à jour importantes de la communauté"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Gestion de Contenu",
            "intro": "Développé un système efficace de gestion de contenu pour gérer les informations liées au jeu et le contenu communautaire."
          },
          "data": {
            "1": {
              "title": "Intégration des Données",
              "description": [
                "Créé un système automatisé de scraping de données pour les mises à jour et actualités du jeu",
                "Implémenté un pipeline de traduction de contenu pour la localisation française",
                "Développé un système de cache utilisant Redis pour une meilleure performance",
                "Construit des outils de validation et modération de contenu"
              ]
            },
            "2": {
              "title": "Fonctionnalités Communautaires",
              "description": [
                "Développé un système de profils utilisateurs avec intégration Discord",
                "Créé des forums communautaires avec mises à jour en temps réel",
                "Implémenté un système de partage et vote de contenu",
                "Ajouté des outils de modération pour la gestion de la communauté"
              ]
            }
          }
        },
        {
          "group": {
            "titre": "Optimisation des Performances",
            "intro": "Implémenté diverses techniques d'optimisation pour assurer des temps de chargement rapides et une expérience utilisateur fluide."
          },
          "data": {
            "1": {
              "title": "Optimisation Frontend",
              "description": [
                "Implémenté le code splitting et le lazy loading pour un chargement initial plus rapide",
                "Optimisé le chargement des images avec le format WebP et des images responsives",
                "Créé une gestion d'état efficace avec Redux",
                "Ajouté un service worker pour la fonctionnalité hors ligne"
              ]
            },
            "2": {
              "title": "Optimisation Backend",
              "description": [
                "Implémenté l'indexation de base de données pour des requêtes plus rapides",
                "Créé des stratégies de cache efficaces avec Redis",
                "Développé la répartition de charge pour plusieurs serveurs",
                "Ajouté la surveillance et la journalisation pour le suivi des performances"
              ]
            }
          }
        }
      ]
    }
  }
}
